m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>SACKCTL</name>
          <displayName>I2C_SACKCTL</displayName>
          <description>I2C Slave ACK Control</description>
          <addressOffset>0x00000820</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ACKOEN</name>
              <description>I2C Slave ACK Override Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ACKOVAL</name>
              <description>I2C Slave ACK Override Value</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFODATA</name>
          <displayName>I2C_FIFODATA</displayName>
          <description>I2C FIFO Data</description>
          <addressOffset>0x00000F00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>I2C TX FIFO Write Data Byte</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFOCTL</name>
          <displayName>I2C_FIFOCTL</displayName>
          <description>I2C FIFO Control</description>
          <addressOffset>0x00000F04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TXTRIG</name>
              <description>TX FIFO Trigger</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMATXENA</name>
              <description>DMA TX Channel Enable</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXFLUSH</name>
              <description>TX FIFO Flush</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXASGNMT</name>
              <description>TX Control Assignment</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RXTRIG</name>
              <description>RX FIFO Trigger</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMARXENA</name>
              <description>DMA RX Channel Enable</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RXFLUSH</name>
              <description>RX FIFO Flush</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RXASGNMT</name>
              <description>RX Control Assignment</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFOSTATUS</name>
          <displayName>I2C_FIFOSTATUS</displayName>
          <description>I2C FIFO Status</description>
          <addressOffset>0x00000F08</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TXFE</name>
              <description>TX FIFO Empty</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXFF</name>
              <description>TX FIFO Full</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXBLWTRIG</name>
              <description>TX FIFO Below Trigger Level</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RXFE</name>
              <description>RX FIFO Empty</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RXFF</name>
              <description>RX FIFO Full</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RXABVTRIG</name>
              <description>RX FIFO Above Trigger Level</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <displayName>I2C_PP</displayName>
          <description>I2C Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HS</name>
              <description>High-Speed Capable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PC</name>
          <displayName>I2C_PC</displayName>
          <description>I2C Peripheral Configuration</description>
          <addressOffset>0x00000FC4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HS</name>
              <description>High-Speed Capable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
