m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>ISC</name>
          <displayName>PWM_ISC</displayName>
          <description>PWM Interrupt Status and Clear</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTPWM0</name>
              <description>PWM0 Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTPWM1</name>
              <description>PWM1 Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTPWM2</name>
              <description>PWM2 Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTPWM3</name>
              <description>PWM3 Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTFAULT0</name>
              <description>FAULT0 Interrupt Asserted</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTFAULT1</name>
              <description>FAULT1 Interrupt Asserted</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTFAULT2</name>
              <description>FAULT2 Interrupt Asserted</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTFAULT3</name>
              <description>FAULT3 Interrupt Asserted</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <displayName>PWM_STATUS</displayName>
          <description>PWM Status</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FAULT0</name>
              <description>Generator 0 Fault Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FAULT1</name>
              <description>Generator 1 Fault Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FAULT2</name>
              <description>Generator 2 Fault Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FAULT3</name>
              <description>Generator 3 Fault Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FAULTVAL</name>
          <displayName>PWM_FAULTVAL</displayName>
          <description>PWM Fault Condition Value</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM0</name>
              <description>MnPWM0 Fault Value</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWM1</name>
              <description>MnPWM1 Fault Value</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWM2</name>
              <description>MnPWM2 Fault Value</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWM3</name>
              <description>MnPWM3 Fault Value</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWM4</name>
              <description>MnPWM4 Fault Value</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWM5</name>
              <description>MnPWM5 Fault Value</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWM6</name>
              <description>MnPWM6 Fault Value</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWM7</name>
              <description>MnPWM7 Fault Value</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ENUPD</name>
          <displayName>PWM_ENUPD</displayName>
          <description>PWM Enable Update</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENUPD0</name>
              <description>MnPWM0 Enable Update Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMM</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSYNC</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GSYNC</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENUPD1</name>
              <description>MnPWM1 Enable Update Mode</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMM</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSYNC</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GSYNC</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENUPD2</name>
              <description>MnPWM2 Enable Update Mode</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMM</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSYNC</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GSYNC</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENUPD3</name>
              <description>MnPWM3 Enable Update Mode</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMM</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSYNC</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GSYNC</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENUPD4</name>
              <description>MnPWM4 Enable Update Mode</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMM</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSYNC</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GSYNC</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENUPD5</name>
              <description>MnPWM5 Enable Update Mode</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMM</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSYNC</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GSYNC</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENUPD6</name>
              <description>MnPWM6 Enable Update Mode</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMM</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSYNC</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GSYNC</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENUPD7</name>
              <description>MnPWM7 Enable Update Mode</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMM</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSYNC</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GSYNC</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
