m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>_2_ISC</name>
          <displayName>PWM_2_ISC</displayName>
          <description>PWM2 Interrupt Status and Clear</description>
          <addressOffset>0x000000CC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTCNTZERO</name>
              <description>Counter=0 Interrupt</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCNTLOAD</name>
              <description>Counter=Load Interrupt</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCMPAU</name>
              <description>Comparator A Up Interrupt</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCMPAD</name>
              <description>Comparator A Down Interrupt</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCMPBU</name>
              <description>Comparator B Up Interrupt</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCMPBD</name>
              <description>Comparator B Down Interrupt</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_2_LOAD</name>
          <displayName>PWM_2_LOAD</displayName>
          <description>PWM2 Load</description>
          <addressOffset>0x000000D0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LOAD</name>
              <description>Counter Load Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_2_COUNT</name>
          <displayName>PWM_2_COUNT</displayName>
          <description>PWM2 Counter</description>
          <addressOffset>0x000000D4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COUNT</name>
              <description>Counter Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_2_CMPA</name>
          <displayName>PWM_2_CMPA</displayName>
          <description>PWM2 Compare A</description>
          <addressOffset>0x000000D8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMPA</name>
              <description>Comparator A Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_2_CMPB</name>
          <displayName>PWM_2_CMPB</displayName>
          <description>PWM2 Compare B</description>
          <addressOffset>0x000000DC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMPB</name>
              <description>Comparator B Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_2_GENA</name>
          <displayName>PWM_2_GENA</displayName>
          <description>PWM2 Generator A Control</description>
          <addressOffset>0x000000E0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ACTZERO</name>
              <description>Action for Counter=0</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Invert pwmA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTLOAD</name>
              <description>Action for Counter=LOAD</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Invert pwmA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTCMPAU</name>
              <description>Action for Comparator A Up</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Invert pwmA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTCMPAD</name>
              <description>Action for Comparator A Down</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Invert pwmA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTCMPBU</name>
              <description>Action for Comparator B Up</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Invert pwmA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTCMPBD</name>
              <description>Action for Comparator B Down</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Invert pwmA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>_2_GENB</name>
          <displayName>PWM_2_GENB</displayName>
          <description>PWM2 Generator B Control</description>
          <addressOffset>0x000000E4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ACTZERO</name>
              <description>Action for Counter=0</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTLOAD</name>
              <description>Action for Counter=LOAD</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTCMPAU</name>
              <description>Action for Comparator A Up</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTCMPAD</name>
              <description>Action for Comparator A Down</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTCMPBU</name>
              <description>Action for Comparator B Up</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTCMPBD</name>
              <description>Action for Comparator B Down</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>_2_DBCTL</name>
          <displayName>PWM_2_DBCTL</displayName>
          <description>PWM2 Dead-Band Control</description>
          <addressOffset>0x000000E8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Dead-Band Generator Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_2_DBRISE</name>
          <displayName>PWM_2_DBRISE</displayName>
          <description>PWM2 Dead-Band Rising-Edge Delay</description>
          <addressOffset>0x000000EC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RISEDELAY</name>
              <description>Dead-Band Rise Delay</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_2_DBFALL</name>
          <displayName>PWM_2_DBFALL</displayName>
          <description>PWM2 Dead-Band Falling-Edge-Delay</description>
          <addressOffset>0x000000F0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FALLDELAY</name>
              <description>Dead-Band Fall Delay</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
