m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>_2_FLTSRC0</name>
          <displayName>PWM_2_FLTSRC0</displayName>
          <description>PWM2 Fault Source 0</description>
          <addressOffset>0x000000F4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FAULT0</name>
              <description>Fault0 Input</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FAULT1</name>
              <description>Fault1 Input</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FAULT2</name>
              <description>Fault2 Input</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FAULT3</name>
              <description>Fault3 Input</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_2_FLTSRC1</name>
          <displayName>PWM_2_FLTSRC1</displayName>
          <description>PWM2 Fault Source 1</description>
          <addressOffset>0x000000F8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DCMP0</name>
              <description>Digital Comparator 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCMP1</name>
              <description>Digital Comparator 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCMP2</name>
              <description>Digital Comparator 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCMP3</name>
              <description>Digital Comparator 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCMP4</name>
              <description>Digital Comparator 4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCMP5</name>
              <description>Digital Comparator 5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCMP6</name>
              <description>Digital Comparator 6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCMP7</name>
              <description>Digital Comparator 7</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_2_MINFLTPER</name>
          <displayName>PWM_2_MINFLTPER</displayName>
          <description>PWM2 Minimum Fault Period</description>
          <addressOffset>0x000000FC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MFP</name>
              <description>Minimum Fault Period</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_CTL</name>
          <displayName>PWM_3_CTL</displayName>
          <description>PWM3 Control</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>PWM Block Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MODE</name>
              <description>Counter Mode</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DEBUG</name>
              <description>Debug Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>LOADUPD</name>
              <description>Load Register Update Mode</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CMPAUPD</name>
              <description>Comparator A Update Mode</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CMPBUPD</name>
              <description>Comparator B Update Mode</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GENAUPD</name>
              <description>PWMnGENA Update Mode</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GENBUPD</name>
              <description>PWMnGENB Update Mode</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBCTLUPD</name>
              <description>PWMnDBCTL Update Mode</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBRISEUPD</name>
              <description>PWMnDBRISE Update Mode</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBFALLUPD</name>
              <description>PWMnDBFALL Update Mode</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLTSRC</name>
              <description>Fault Condition Source</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MINFLTPER</name>
              <description>Minimum Fault Period</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>LATCH</name>
              <description>Latch Fault Input</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_INTEN</name>
          <displayName>PWM_3_INTEN</displayName>
          <description>PWM3 Interrupt and Trigger Enable</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTCNTZERO</name>
              <description>Interrupt for Counter=0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCNTLOAD</name>
              <description>Interrupt for Counter=PWMnLOAD</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCMPAU</name>
              <description>Interrupt for Counter=PWMnCMPA Up</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCMPAD</name>
              <description>Interrupt for Counter=PWMnCMPA Down</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCMPBU</name>
              <description>Interrupt for Counter=PWMnCMPB Up</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCMPBD</name>
              <description>Interrupt for Counter=PWMnCMPB Down</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRCNTZERO</name>
              <description>Trigger for Counter=0</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRCNTLOAD</name>
              <description>Trigger for Counter=PWMnLOAD</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRCMPAU</name>
              <description>Trigger for Counter=PWMnCMPA Up</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRCMPAD</name>
              <description>Trigger for Counter=PWMnCMPA Down</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRCMPBU</name>
              <description>Trigger for Counter=PWMnCMPB Up</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRCMPBD</name>
              <description>Trigger for Counter=PWMnCMPB Down</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
