m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>_3_RIS</name>
          <displayName>PWM_3_RIS</displayName>
          <description>PWM3 Raw Interrupt Status</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTCNTZERO</name>
              <description>Counter=0 Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCNTLOAD</name>
              <description>Counter=Load Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCMPAU</name>
              <description>Comparator A Up Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCMPAD</name>
              <description>Comparator A Down Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCMPBU</name>
              <description>Comparator B Up Interrupt Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCMPBD</name>
              <description>Comparator B Down Interrupt Status</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_ISC</name>
          <displayName>PWM_3_ISC</displayName>
          <description>PWM3 Interrupt Status and Clear</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTCNTZERO</name>
              <description>Counter=0 Interrupt</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCNTLOAD</name>
              <description>Counter=Load Interrupt</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCMPAU</name>
              <description>Comparator A Up Interrupt</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCMPAD</name>
              <description>Comparator A Down Interrupt</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCMPBU</name>
              <description>Comparator B Up Interrupt</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCMPBD</name>
              <description>Comparator B Down Interrupt</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_LOAD</name>
          <displayName>PWM_3_LOAD</displayName>
          <description>PWM3 Load</description>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LOAD</name>
              <description>Counter Load Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_COUNT</name>
          <displayName>PWM_3_COUNT</displayName>
          <description>PWM3 Counter</description>
          <addressOffset>0x00000114</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COUNT</name>
              <description>Counter Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_CMPA</name>
          <displayName>PWM_3_CMPA</displayName>
          <description>PWM3 Compare A</description>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMPA</name>
              <description>Comparator A Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_CMPB</name>
          <displayName>PWM_3_CMPB</displayName>
          <description>PWM3 Compare B</description>
          <addressOffset>0x0000011C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMPB</name>
              <description>Comparator B Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_GENA</name>
          <displayName>PWM_3_GENA</displayName>
          <description>PWM3 Generator A Control</description>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ACTZERO</name>
              <description>Action for Counter=0</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Invert pwmA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTLOAD</name>
              <description>Action for Counter=LOAD</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Invert pwmA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTCMPAU</name>
              <description>Action for Comparator A Up</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Invert pwmA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTCMPAD</name>
              <description>Action for Comparator A Down</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Invert pwmA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTCMPBU</name>
              <description>Action for Comparator B Up</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Invert pwmA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTCMPBD</name>
              <description>Action for Comparator B Down</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Invert pwmA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
