m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>_3_GENB</name>
          <displayName>PWM_3_GENB</displayName>
          <description>PWM3 Generator B Control</description>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ACTZERO</name>
              <description>Action for Counter=0</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTLOAD</name>
              <description>Action for Counter=LOAD</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTCMPAU</name>
              <description>Action for Comparator A Up</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTCMPAD</name>
              <description>Action for Comparator A Down</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTCMPBU</name>
              <description>Action for Comparator B Up</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTCMPBD</name>
              <description>Action for Comparator B Down</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_DBCTL</name>
          <displayName>PWM_3_DBCTL</displayName>
          <description>PWM3 Dead-Band Control</description>
          <addressOffset>0x00000128</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Dead-Band Generator Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_DBRISE</name>
          <displayName>PWM_3_DBRISE</displayName>
          <description>PWM3 Dead-Band Rising-Edge Delay</description>
          <addressOffset>0x0000012C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RISEDELAY</name>
              <description>Dead-Band Rise Delay</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_DBFALL</name>
          <displayName>PWM_3_DBFALL</displayName>
          <description>PWM3 Dead-Band Falling-Edge-Delay</description>
          <addressOffset>0x00000130</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FALLDELAY</name>
              <description>Dead-Band Fall Delay</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_FLTSRC0</name>
          <displayName>PWM_3_FLTSRC0</displayName>
          <description>PWM3 Fault Source 0</description>
          <addressOffset>0x00000134</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FAULT0</name>
              <description>Fault0 Input</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FAULT1</name>
              <description>Fault1 Input</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FAULT2</name>
              <description>Fault2 Input</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FAULT3</name>
              <description>Fault3 Input</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_FLTSRC1</name>
          <displayName>PWM_3_FLTSRC1</displayName>
          <description>PWM3 Fault Source 1</description>
          <addressOffset>0x00000138</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DCMP0</name>
              <description>Digital Comparator 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCMP1</name>
              <description>Digital Comparator 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCMP2</name>
              <description>Digital Comparator 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCMP3</name>
              <description>Digital Comparator 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCMP4</name>
              <description>Digital Comparator 4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCMP5</name>
              <description>Digital Comparator 5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCMP6</name>
              <description>Digital Comparator 6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCMP7</name>
              <description>Digital Comparator 7</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_MINFLTPER</name>
          <displayName>PWM_3_MINFLTPER</displayName>
          <description>PWM3 Minimum Fault Period</description>
          <addressOffset>0x0000013C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MFP</name>
              <description>Minimum Fault Period</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_FLTSEN</name>
          <displayName>PWM_0_FLTSEN</displayName>
          <description>PWM0 Fault Pin Logic Sense</description>
          <addressOffset>0x00000800</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FAULT0</name>
              <description>Fault0 Sense</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FAULT1</name>
              <description>Fault1 Sense</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FAULT2</name>
              <description>Fault2 Sense</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FAULT3</name>
              <description>Fault3 Sense</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_FLTSTAT0</name>
          <displayName>PWM_0_FLTSTAT0</displayName>
          <description>PWM0 Fault Status 0</description>
          <addressOffset>0x00000804</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FAULT0</name>
              <description>Fault Input 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FAULT1</name>
              <description>Fault Input 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FAULT2</name>
              <description>Fault Input 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FAULT3</name>
              <description>Fault Input 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
