m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>DCCTL0</name>
          <displayName>ADC_DCCTL0</displayName>
          <description>ADC Digital Comparator Control 0</description>
          <addressOffset>0x00000E00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CIM</name>
              <description>Comparison Interrupt Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIC</name>
              <description>Comparison Interrupt Condition</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIE</name>
              <description>Comparison Interrupt Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CTM</name>
              <description>Comparison Trigger Mode</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTC</name>
              <description>Comparison Trigger Condition</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTE</name>
              <description>Comparison Trigger Enable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCTL1</name>
          <displayName>ADC_DCCTL1</displayName>
          <description>ADC Digital Comparator Control 1</description>
          <addressOffset>0x00000E04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CIM</name>
              <description>Comparison Interrupt Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIC</name>
              <description>Comparison Interrupt Condition</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIE</name>
              <description>Comparison Interrupt Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CTM</name>
              <description>Comparison Trigger Mode</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTC</name>
              <description>Comparison Trigger Condition</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTE</name>
              <description>Comparison Trigger Enable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCTL2</name>
          <displayName>ADC_DCCTL2</displayName>
          <description>ADC Digital Comparator Control 2</description>
          <addressOffset>0x00000E08</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CIM</name>
              <description>Comparison Interrupt Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIC</name>
              <description>Comparison Interrupt Condition</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIE</name>
              <description>Comparison Interrupt Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CTM</name>
              <description>Comparison Trigger Mode</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTC</name>
              <description>Comparison Trigger Condition</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTE</name>
              <description>Comparison Trigger Enable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCTL3</name>
          <displayName>ADC_DCCTL3</displayName>
          <description>ADC Digital Comparator Control 3</description>
          <addressOffset>0x00000E0C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CIM</name>
              <description>Comparison Interrupt Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIC</name>
              <description>Comparison Interrupt Condition</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIE</name>
              <description>Comparison Interrupt Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CTM</name>
              <description>Comparison Trigger Mode</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTC</name>
              <description>Comparison Trigger Condition</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTE</name>
              <description>Comparison Trigger Enable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
