m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>DCCMP1</name>
          <displayName>ADC_DCCMP1</displayName>
          <description>ADC Digital Comparator Range 1</description>
          <addressOffset>0x00000E44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP2</name>
          <displayName>ADC_DCCMP2</displayName>
          <description>ADC Digital Comparator Range 2</description>
          <addressOffset>0x00000E48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP3</name>
          <displayName>ADC_DCCMP3</displayName>
          <description>ADC Digital Comparator Range 3</description>
          <addressOffset>0x00000E4C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP4</name>
          <displayName>ADC_DCCMP4</displayName>
          <description>ADC Digital Comparator Range 4</description>
          <addressOffset>0x00000E50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP5</name>
          <displayName>ADC_DCCMP5</displayName>
          <description>ADC Digital Comparator Range 5</description>
          <addressOffset>0x00000E54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP6</name>
          <displayName>ADC_DCCMP6</displayName>
          <description>ADC Digital Comparator Range 6</description>
          <addressOffset>0x00000E58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP7</name>
          <displayName>ADC_DCCMP7</displayName>
          <description>ADC Digital Comparator Range 7</description>
          <addressOffset>0x00000E5C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <displayName>ADC_PP</displayName>
          <description>ADC Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MCR</name>
              <description>Maximum Conversion Rate</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>Full conversion rate (FCONV) as defined by TADC and NSH</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH</name>
              <description>ADC Channel Count</description>
              <lsb>4</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DC</name>
              <description>Digital Comparator Count</description>
              <lsb>10</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TYPE</name>
              <description>ADC Architecture</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAR</name>
                  <description>SAR</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSL</name>
              <description>Resolution</description>
              <lsb>18</lsb>
              <msb>22</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TS</name>
              <description>Temperature Sensor</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>APSHT</name>
              <description>Application-Programmable Sample-and-Hold Time</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PC</name>
          <displayName>ADC_PC</displayName>
          <description>ADC Peripheral Configuration</description>
          <addressOffset>0x00000FC4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MCR</name>
              <description>Conversion Rate</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_1_8</name>
                  <description>Eighth conversion rate. After a conversion completes, the logic pauses for 112 TADC periods before starting the next conversion</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_4</name>
                  <description>Quarter conversion rate. After a conversion completes, the logic pauses for 48 TADC periods before starting the next conversion</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_2</name>
                  <description>Half conversion rate. After a conversion completes, the logic pauses for 16 TADC periods before starting the next conversion</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>Full conversion rate (FCONV) as defined by TADC and NSH</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CC</name>
          <displayName>ADC_CC</displayName>
          <description>ADC Clock Configuration</description>
          <addressOffset>0x00000FC8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CS</name>
              <description>ADC Clock Source</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSPLL</name>
                  <description>PLL VCO divided by CLKDIV</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIOSC</name>
                  <description>PIOSC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOSC</name>
                  <description>MOSC</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>PLL VCO Clock Divisor</description>
              <lsb>4</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
