m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>IF2MCTL</name>
          <displayName>CAN_IF2MCTL</displayName>
          <description>CAN IF2 Message Control</description>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DLC</name>
              <description>Data Length Code</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EOB</name>
              <description>End of Buffer</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXRQST</name>
              <description>Transmit Request</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RMTEN</name>
              <description>Remote Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RXIE</name>
              <description>Receive Interrupt Enable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXIE</name>
              <description>Transmit Interrupt Enable</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UMASK</name>
              <description>Use Acceptance Mask</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTPND</name>
              <description>Interrupt Pending</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MSGLST</name>
              <description>Message Lost</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NEWDAT</name>
              <description>New Data</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IF2DA1</name>
          <displayName>CAN_IF2DA1</displayName>
          <description>CAN IF2 Data A1</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IF2DA2</name>
          <displayName>CAN_IF2DA2</displayName>
          <description>CAN IF2 Data A2</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IF2DB1</name>
          <displayName>CAN_IF2DB1</displayName>
          <description>CAN IF2 Data B1</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IF2DB2</name>
          <displayName>CAN_IF2DB2</displayName>
          <description>CAN IF2 Data B2</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXRQ1</name>
          <displayName>CAN_TXRQ1</displayName>
          <description>CAN Transmission Request 1</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TXRQST</name>
              <description>Transmission Request Bits</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXRQ2</name>
          <displayName>CAN_TXRQ2</displayName>
          <description>CAN Transmission Request 2</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TXRQST</name>
              <description>Transmission Request Bits</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>NWDA1</name>
          <displayName>CAN_NWDA1</displayName>
          <description>CAN New Data 1</description>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NEWDAT</name>
              <description>New Data Bits</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>NWDA2</name>
          <displayName>CAN_NWDA2</displayName>
          <description>CAN New Data 2</description>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NEWDAT</name>
              <description>New Data Bits</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MSG1INT</name>
          <displayName>CAN_MSG1INT</displayName>
          <description>CAN Message 1 Interrupt Pending</description>
          <addressOffset>0x00000140</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTPND</name>
              <description>Interrupt Pending Bits</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MSG2INT</name>
          <displayName>CAN_MSG2INT</displayName>
          <description>CAN Message 2 Interrupt Pending</description>
          <addressOffset>0x00000144</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTPND</name>
              <description>Interrupt Pending Bits</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MSG1VAL</name>
          <displayName>CAN_MSG1VAL</displayName>
          <description>CAN Message 1 Valid</description>
          <addressOffset>0x00000160</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MSGVAL</name>
              <description>Message Valid Bits</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MSG2VAL</name>
          <displayName>CAN_MSG2VAL</displayName>
          <description>CAN Message 2 Valid</description>
          <addressOffset>0x00000164</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MSGVAL</name>
              <description>Message Valid Bits</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
