m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>RXFUNCADDR2</name>
          <displayName>USB_RXFUNCADDR2</displayName>
          <description>USB Receive Functional Address Endpoint 2</description>
          <addressOffset>0x00000094</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR2</name>
          <displayName>USB_RXHUBADDR2</displayName>
          <description>USB Receive Hub Address Endpoint 2</description>
          <addressOffset>0x00000096</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBPORT2</name>
          <displayName>USB_RXHUBPORT2</displayName>
          <description>USB Receive Hub Port Endpoint 2</description>
          <addressOffset>0x00000097</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR3</name>
          <displayName>USB_TXFUNCADDR3</displayName>
          <description>USB Transmit Functional Address Endpoint 3</description>
          <addressOffset>0x00000098</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR3</name>
          <displayName>USB_TXHUBADDR3</displayName>
          <description>USB Transmit Hub Address Endpoint 3</description>
          <addressOffset>0x0000009A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT3</name>
          <displayName>USB_TXHUBPORT3</displayName>
          <description>USB Transmit Hub Port Endpoint 3</description>
          <addressOffset>0x0000009B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR3</name>
          <displayName>USB_RXFUNCADDR3</displayName>
          <description>USB Receive Functional Address Endpoint 3</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR3</name>
          <displayName>USB_RXHUBADDR3</displayName>
          <description>USB Receive Hub Address Endpoint 3</description>
          <addressOffset>0x0000009E</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBPORT3</name>
          <displayName>USB_RXHUBPORT3</displayName>
          <description>USB Receive Hub Port Endpoint 3</description>
          <addressOffset>0x0000009F</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR4</name>
          <displayName>USB_TXFUNCADDR4</displayName>
          <description>USB Transmit Functional Address Endpoint 4</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR4</name>
          <displayName>USB_TXHUBADDR4</displayName>
          <description>USB Transmit Hub Address Endpoint 4</description>
          <addressOffset>0x000000A2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT4</name>
          <displayName>USB_TXHUBPORT4</displayName>
          <description>USB Transmit Hub Port Endpoint 4</description>
          <addressOffset>0x000000A3</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR4</name>
          <displayName>USB_RXFUNCADDR4</displayName>
          <description>USB Receive Functional Address Endpoint 4</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR4</name>
          <displayName>USB_RXHUBADDR4</displayName>
          <description>USB Receive Hub Address Endpoint 4</description>
          <addressOffset>0x000000A6</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBPORT4</name>
          <displayName>USB_RXHUBPORT4</displayName>
          <description>USB Receive Hub Port Endpoint 4</description>
          <addressOffset>0x000000A7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR5</name>
          <displayName>USB_TXFUNCADDR5</displayName>
          <description>USB Transmit Functional Address Endpoint 5</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR5</name>
          <displayName>USB_TXHUBADDR5</displayName>
          <description>USB Transmit Hub Address Endpoint 5</description>
          <addressOffset>0x000000AA</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT5</name>
          <displayName>USB_TXHUBPORT5</displayName>
          <description>USB Transmit Hub Port Endpoint 5</description>
          <addressOffset>0x000000AB</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR5</name>
          <displayName>USB_RXFUNCADDR5</displayName>
          <description>USB Receive Functional Address Endpoint 5</description>
          <addressOffset>0x000000AC</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR5</name>
          <displayName>USB_RXHUBADDR5</displayName>
          <description>USB Receive Hub Address Endpoint 5</description>
          <addressOffset>0x000000AE</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBPORT5</name>
          <displayName>USB_RXHUBPORT5</displayName>
          <description>USB Receive Hub Port Endpoint 5</description>
          <addressOffset>0x000000AF</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR6</name>
          <displayName>USB_TXFUNCADDR6</displayName>
          <description>USB Transmit Functional Address Endpoint 6</description>
          <addressOffset>0x000000B0</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR6</name>
          <displayName>USB_TXHUBADDR6</displayName>
          <description>USB Transmit Hub Address Endpoint 6</description>
          <addressOffset>0x000000B2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT6</name>
          <displayName>USB_TXHUBPORT6</displayName>
          <description>USB Transmit Hub Port Endpoint 6</description>
          <addressOffset>0x000000B3</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR6</name>
          <displayName>USB_RXFUNCADDR6</displayName>
          <description>USB Receive Functional Address Endpoint 6</description>
          <addressOffset>0x000000B4</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR6</name>
          <displayName>USB_RXHUBADDR6</displayName>
          <description>USB Receive Hub Address Endpoint 6</description>
          <addressOffset>0x000000B6</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBPORT6</name>
          <displayName>USB_RXHUBPORT6</displayName>
          <description>USB Receive Hub Port Endpoint 6</description>
          <addressOffset>0x000000B7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR7</name>
          <displayName>USB_TXFUNCADDR7</displayName>
          <description>USB Transmit Functional Address Endpoint 7</description>
          <addressOffset>0x000000B8</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR7</name>
          <displayName>USB_TXHUBADDR7</displayName>
          <description>USB Transmit Hub Address Endpoint 7</description>
          <addressOffset>0x000000BA</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT7</name>
          <displayName>USB_TXHUBPORT7</displayName>
          <description>USB Transmit Hub Port Endpoint 7</description>
          <addressOffset>0x000000BB</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR7</name>
          <displayName>USB_RXFUNCADDR7</displayName>
          <description>USB Receive Functional Address Endpoint 7</description>
          <addressOffset>0x000000BC</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR7</name>
          <displayName>USB_RXHUBADDR7</displayName>
          <description>USB Receive Hub Address Endpoint 7</description>
          <addressOffset>0x000000BE</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
