m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>DMAINTR</name>
          <displayName>USB_DMAINTR</displayName>
          <description>USB DMA Interrupt</description>
          <addressOffset>0x00000200</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>CH0</name>
              <description>Channel 0 DMA Interrupt</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CH1</name>
              <description>Channel 1 DMA Interrupt</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CH2</name>
              <description>Channel 2 DMA Interrupt</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CH3</name>
              <description>Channel 3 DMA Interrupt</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CH4</name>
              <description>Channel 4 DMA Interrupt</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CH5</name>
              <description>Channel 5 DMA Interrupt</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CH6</name>
              <description>Channel 6 DMA Interrupt</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CH7</name>
              <description>Channel 7 DMA Interrupt</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTL0</name>
          <displayName>USB_DMACTL0</displayName>
          <description>USB DMA Control 0</description>
          <addressOffset>0x00000204</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>DMA Transfer Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DIR</name>
              <description>DMA Direction</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MODE</name>
              <description>DMA Transfer Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IE</name>
              <description>DMA Interrupt Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP</name>
              <description>Endpoint number</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ERR</name>
              <description>Bus Error Bit</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BRSTM</name>
              <description>Burst Mode</description>
              <lsb>9</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ANY</name>
                  <description>Bursts of unspecified length</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC4</name>
                  <description>INCR4 or unspecified length</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC8</name>
                  <description>INCR8, INCR4 or unspecified length</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC16</name>
                  <description>INCR16, INCR8, INCR4 or unspecified length</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAADDR0</name>
          <displayName>USB_DMAADDR0</displayName>
          <description>USB DMA Address 0</description>
          <addressOffset>0x00000208</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>DMA Address</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1073741823</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACOUNT0</name>
          <displayName>USB_DMACOUNT0</displayName>
          <description>USB DMA Count 0</description>
          <addressOffset>0x0000020C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COUNT</name>
              <description>DMA Count</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1073741823</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTL1</name>
          <displayName>USB_DMACTL1</displayName>
          <description>USB DMA Control 1</description>
          <addressOffset>0x00000214</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>DMA Transfer Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DIR</name>
              <description>DMA Direction</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MODE</name>
              <description>DMA Transfer Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IE</name>
              <description>DMA Interrupt Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP</name>
              <description>Endpoint number</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ERR</name>
              <description>Bus Error Bit</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BRSTM</name>
              <description>Burst Mode</description>
              <lsb>9</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ANY</name>
                  <description>Bursts of unspecified length</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC4</name>
                  <description>INCR4 or unspecified length</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC8</name>
                  <description>INCR8, INCR4 or unspecified length</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC16</name>
                  <description>INCR16, INCR8, INCR4 or unspecified length</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAADDR1</name>
          <displayName>USB_DMAADDR1</displayName>
          <description>USB DMA Address 1</description>
          <addressOffset>0x00000218</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>DMA Address</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1073741823</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACOUNT1</name>
          <displayName>USB_DMACOUNT1</displayName>
          <description>USB DMA Count 1</description>
          <addressOffset>0x0000021C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COUNT</name>
              <description>DMA Count</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1073741823</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTL2</name>
          <displayName>USB_DMACTL2</displayName>
          <description>USB DMA Control 2</description>
          <addressOffset>0x00000224</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>DMA Transfer Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DIR</name>
              <description>DMA Direction</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MODE</name>
              <description>DMA Transfer Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IE</name>
              <description>DMA Interrupt Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP</name>
              <description>Endpoint number</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ERR</name>
              <description>Bus Error Bit</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BRSTM</name>
              <description>Burst Mode</description>
              <lsb>9</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ANY</name>
                  <description>Bursts of unspecified length</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC4</name>
                  <description>INCR4 or unspecified length</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC8</name>
                  <description>INCR8, INCR4 or unspecified length</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC16</name>
                  <description>INCR16, INCR8, INCR4 or unspecified length</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAADDR2</name>
          <displayName>USB_DMAADDR2</displayName>
          <description>USB DMA Address 2</description>
          <addressOffset>0x00000228</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>DMA Address</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1073741823</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACOUNT2</name>
          <displayName>USB_DMACOUNT2</displayName>
          <description>USB DMA Count 2</description>
          <addressOffset>0x0000022C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COUNT</name>
              <description>DMA Count</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1073741823</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
