m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>DMACTL3</name>
          <displayName>USB_DMACTL3</displayName>
          <description>USB DMA Control 3</description>
          <addressOffset>0x00000234</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>DMA Transfer Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DIR</name>
              <description>DMA Direction</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MODE</name>
              <description>DMA Transfer Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IE</name>
              <description>DMA Interrupt Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP</name>
              <description>Endpoint number</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ERR</name>
              <description>Bus Error Bit</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BRSTM</name>
              <description>Burst Mode</description>
              <lsb>9</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ANY</name>
                  <description>Bursts of unspecified length</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC4</name>
                  <description>INCR4 or unspecified length</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC8</name>
                  <description>INCR8, INCR4 or unspecified length</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC16</name>
                  <description>INCR16, INCR8, INCR4 or unspecified length</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAADDR3</name>
          <displayName>USB_DMAADDR3</displayName>
          <description>USB DMA Address 3</description>
          <addressOffset>0x00000238</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>DMA Address</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1073741823</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACOUNT3</name>
          <displayName>USB_DMACOUNT3</displayName>
          <description>USB DMA Count 3</description>
          <addressOffset>0x0000023C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COUNT</name>
              <description>DMA Count</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1073741823</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTL4</name>
          <displayName>USB_DMACTL4</displayName>
          <description>USB DMA Control 4</description>
          <addressOffset>0x00000244</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>DMA Transfer Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DIR</name>
              <description>DMA Direction</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MODE</name>
              <description>DMA Transfer Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IE</name>
              <description>DMA Interrupt Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP</name>
              <description>Endpoint number</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ERR</name>
              <description>Bus Error Bit</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BRSTM</name>
              <description>Burst Mode</description>
              <lsb>9</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ANY</name>
                  <description>Bursts of unspecified length</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC4</name>
                  <description>INCR4 or unspecified length</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC8</name>
                  <description>INCR8, INCR4 or unspecified length</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC16</name>
                  <description>INCR16, INCR8, INCR4 or unspecified length</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAADDR4</name>
          <displayName>USB_DMAADDR4</displayName>
          <description>USB DMA Address 4</description>
          <addressOffset>0x00000248</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>DMA Address</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1073741823</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACOUNT4</name>
          <displayName>USB_DMACOUNT4</displayName>
          <description>USB DMA Count 4</description>
          <addressOffset>0x0000024C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COUNT</name>
              <description>DMA Count</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1073741823</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTL5</name>
          <displayName>USB_DMACTL5</displayName>
          <description>USB DMA Control 5</description>
          <addressOffset>0x00000254</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>DMA Transfer Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DIR</name>
              <description>DMA Direction</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MODE</name>
              <description>DMA Transfer Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IE</name>
              <description>DMA Interrupt Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP</name>
              <description>Endpoint number</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ERR</name>
              <description>Bus Error Bit</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BRSTM</name>
              <description>Burst Mode</description>
              <lsb>9</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ANY</name>
                  <description>Bursts of unspecified length</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC4</name>
                  <description>INCR4 or unspecified length</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC8</name>
                  <description>INCR8, INCR4 or unspecified length</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC16</name>
                  <description>INCR16, INCR8, INCR4 or unspecified length</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAADDR5</name>
          <displayName>USB_DMAADDR5</displayName>
          <description>USB DMA Address 5</description>
          <addressOffset>0x00000258</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>DMA Address</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1073741823</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACOUNT5</name>
          <displayName>USB_DMACOUNT5</displayName>
          <description>USB DMA Count 5</description>
          <addressOffset>0x0000025C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COUNT</name>
              <description>DMA Count</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1073741823</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTL6</name>
          <displayName>USB_DMACTL6</displayName>
          <description>USB DMA Control 6</description>
          <addressOffset>0x00000264</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>DMA Transfer Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DIR</name>
              <description>DMA Direction</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MODE</name>
              <description>DMA Transfer Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IE</name>
              <description>DMA Interrupt Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP</name>
              <description>Endpoint number</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ERR</name>
              <description>Bus Error Bit</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BRSTM</name>
              <description>Burst Mode</description>
              <lsb>9</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ANY</name>
                  <description>Bursts of unspecified length</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC4</name>
                  <description>INCR4 or unspecified length</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC8</name>
                  <description>INCR8, INCR4 or unspecified length</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC16</name>
                  <description>INCR16, INCR8, INCR4 or unspecified length</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAADDR6</name>
          <displayName>USB_DMAADDR6</displayName>
          <description>USB DMA Address 6</description>
          <addressOffset>0x00000268</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>DMA Address</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1073741823</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACOUNT6</name>
          <displayName>USB_DMACOUNT6</displayName>
          <description>USB DMA Count 6</description>
          <addressOffset>0x0000026C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COUNT</name>
              <description>DMA Count</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1073741823</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
