m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>LPMCNTRL</name>
          <displayName>USB_LPMCNTRL</displayName>
          <description>USB LPM Control</description>
          <addressOffset>0x00000362</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TXLPM</name>
              <description>Transmit LPM Transaction Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RES</name>
              <description>LPM Resume</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EN</name>
              <description>LPM Enable</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>LPM and Extended transactions are not supported. In this case, the USB does not respond to LPM transactions and LPM transactions cause a timeout</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT</name>
                  <description>LPM is not supported but extended transactions are supported. In this case, the USB does respond to an LPM transaction with a STALL</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPMEXT</name>
                  <description>The USB supports LPM extended transactions. In this case, the USB responds with a NYET or an ACK as determined by the value of TXLPM and other conditions</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NAK</name>
              <description>LPM NAK</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>LPMIM</name>
          <displayName>USB_LPMIM</displayName>
          <description>USB LPM Interrupt Mask</description>
          <addressOffset>0x00000363</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>STALL</name>
              <description>LPM STALL Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NY</name>
              <description>LPM NY Interrupt Mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ACK</name>
              <description>LPM ACK Interrupt Mask</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NC</name>
              <description>LPM NC Interrupt Mask</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RES</name>
              <description>LPM Resume Interrupt Mask</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ERR</name>
              <description>LPM Error Interrupt Mask</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>LPMRIS</name>
          <displayName>USB_LPMRIS</displayName>
          <description>USB LPM Raw Interrupt Status</description>
          <addressOffset>0x00000364</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>LPMST</name>
              <description>LPM STALL Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NY</name>
              <description>LPM NY Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ACK</name>
              <description>LPM ACK Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NC</name>
              <description>LPM NC Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RES</name>
              <description>LPM Resume Interrupt Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ERR</name>
              <description>LPM Interrupt Status</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>LPMFADDR</name>
          <displayName>USB_LPMFADDR</displayName>
          <description>USB LPM Function Address</description>
          <addressOffset>0x00000365</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>LPM Function Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EPC</name>
          <displayName>USB_EPC</displayName>
          <description>USB External Power Control</description>
          <addressOffset>0x00000400</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPEN</name>
              <description>External Power Supply Enable Configuration</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Power Enable Active Low</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Power Enable Active High</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBLOW</name>
                  <description>Power Enable High if VBUS Low (OTG only)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBHIGH</name>
                  <description>Power Enable High if VBUS High (OTG only)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPENDE</name>
              <description>EPEN Drive Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PFLTEN</name>
              <description>Power Fault Input Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PFLTSEN_HIGH</name>
              <description>Power Fault Sense</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PFLTAEN</name>
              <description>Power Fault Action Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PFLTACT</name>
              <description>Power Fault Action</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHG</name>
                  <description>Unchanged</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIS</name>
                  <description>Tristate</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EPCRIS</name>
          <displayName>USB_EPCRIS</displayName>
          <description>USB External Power Control Raw Interrupt Status</description>
          <addressOffset>0x00000404</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PF</name>
              <description>USB Power Fault Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EPCIM</name>
          <displayName>USB_EPCIM</displayName>
          <description>USB External Power Control Interrupt Mask</description>
          <addressOffset>0x00000408</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PF</name>
              <description>USB Power Fault Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EPCISC</name>
          <displayName>USB_EPCISC</displayName>
          <description>USB External Power Control Interrupt Status and Clear</description>
          <addressOffset>0x0000040C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PF</name>
              <description>USB Power Fault Interrupt Status and Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DRRIS</name>
          <displayName>USB_DRRIS</displayName>
          <description>USB Device RESUME Raw Interrupt Status</description>
          <addressOffset>0x00000410</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESUME</name>
              <description>RESUME Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DRIM</name>
          <displayName>USB_DRIM</displayName>
          <description>USB Device RESUME Interrupt Mask</description>
          <addressOffset>0x00000414</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESUME</name>
              <description>RESUME Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DRISC</name>
          <displayName>USB_DRISC</displayName>
          <description>USB Device RESUME Interrupt Status and Clear</description>
          <addressOffset>0x00000418</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESUME</name>
              <description>RESUME Interrupt Status and Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>GPCS</name>
          <displayName>USB_GPCS</displayName>
          <description>USB General-Purpose Control and Status</description>
          <addressOffset>0x0000041C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DEVMOD</name>
              <description>Device Mode</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OTG</name>
                  <description>Use USB0VBUS and USB0ID pin</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOST</name>
                  <description>Force USB0VBUS and USB0ID low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEV</name>
                  <description>Force USB0VBUS and USB0ID high</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOSTVBUS</name>
                  <description>Use USB0VBUS and force USB0ID low</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEVVBUS</name>
                  <description>Use USB0VBUS and force USB0ID high</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VDC</name>
          <displayName>USB_VDC</displayName>
          <description>USB VBUS Droop Control</description>
          <addressOffset>0x00000430</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VBDEN</name>
              <description>VBUS Droop Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>VDCRIS</name>
          <displayName>USB_VDCRIS</displayName>
          <description>USB VBUS Droop Control Raw Interrupt Status</description>
          <addressOffset>0x00000434</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VD</name>
              <description>VBUS Droop Raw Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>VDCIM</name>
          <displayName>USB_VDCIM</displayName>
          <description>USB VBUS Droop Control Interrupt Mask</description>
          <addressOffset>0x00000438</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VD</name>
              <description>VBUS Droop Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>VDCISC</name>
          <displayName>USB_VDCISC</displayName>
          <description>USB VBUS Droop Control Interrupt Status and Clear</description>
          <addressOffset>0x0000043C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VD</name>
              <description>VBUS Droop Interrupt Status and Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
