m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>EEHIDE0</name>
          <displayName>EEPROM_EEHIDE0</displayName>
          <description>EEPROM Block Hide 0</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HN</name>
              <description>Hide Block</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2147483647</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EEHIDE1</name>
          <displayName>EEPROM_EEHIDE1</displayName>
          <description>EEPROM Block Hide 1</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HN</name>
              <description>Hide Block</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EEHIDE2</name>
          <displayName>EEPROM_EEHIDE2</displayName>
          <description>EEPROM Block Hide 2</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HN</name>
              <description>Hide Block</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EEDBGME</name>
          <displayName>EEPROM_EEDBGME</displayName>
          <description>EEPROM Debug Mass Erase</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ME</name>
              <description>Mass Erase</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>KEY</name>
              <description>Erase Key</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <displayName>EEPROM_PP</displayName>
          <description>EEPROM Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SIZE</name>
              <description>EEPROM Size</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_64</name>
                  <description>64 bytes of EEPROM</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_128</name>
                  <description>128 bytes of EEPROM</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_256</name>
                  <description>256 bytes of EEPROM</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_512</name>
                  <description>512 bytes of EEPROM</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1K</name>
                  <description>1 KB of EEPROM</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2K</name>
                  <description>2 KB of EEPROM</description>
                  <value>0x1f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_3K</name>
                  <description>3 KB of EEPROM</description>
                  <value>0x3f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4K</name>
                  <description>4 KB of EEPROM</description>
                  <value>0x7f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_5K</name>
                  <description>5 KB of EEPROM</description>
                  <value>0xff</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_6K</name>
                  <description>6 KB of EEPROM</description>
                  <value>0x1ff</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
