m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>HB16CFG2</name>
          <displayName>EPI_HB16CFG2</displayName>
          <description>EPI Host-Bus 16 Configuration 2</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MODE</name>
              <description>CS1n Host Bus Sub-Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADMUX</name>
                  <description>ADMUX - AD[15:0]</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AD</name>
                  <description>ADNONMUX - D[15:0]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDWS</name>
              <description>CS1n Read Wait States</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_2</name>
                  <description>Active RDn is 2 EPI clocks</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4</name>
                  <description>Active RDn is 4 EPI clocks</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_6</name>
                  <description>Active RDn is 6 EPI clocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8</name>
                  <description>Active RDn is 8 EPI clocks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRWS</name>
              <description>CS1n Write Wait States</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_2</name>
                  <description>Active WRn is 2 EPI clocks</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4</name>
                  <description>Active WRn is 4 EPI clocks</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_6</name>
                  <description>Active WRn is 6 EPI clocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8</name>
                  <description>Active WRn is 8 EPI clocks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BURST</name>
              <description>CS1n Burst Mode</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RDCRE</name>
              <description>CS1n PSRAM Configuration Register Read</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WRCRE</name>
              <description>CS1n PSRAM Configuration Register Write</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ALEHIGH</name>
              <description>CS1n ALE Strobe Polarity</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RDHIGH</name>
              <description>CS1n READ Strobe Polarity</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WRHIGH</name>
              <description>CS1n WRITE Strobe Polarity</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CSCFG</name>
              <description>Chip Select Configuration</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALE</name>
                  <description>ALE Configuration</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CS</name>
                  <description>CSn Configuration</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCS</name>
                  <description>Dual CSn Configuration</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCS</name>
                  <description>ALE with Dual CSn Configuration</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSBAUD</name>
              <description>Chip Select Baud Rate and Multiple Sub-Mode Configuration enable</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CSCFGEXT</name>
              <description>Chip Select Extended Configuration</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDRMAP</name>
          <displayName>EPI_ADDRMAP</displayName>
          <description>EPI Address Map</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ERADR</name>
              <description>External RAM Address</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Not mapped</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_6000</name>
                  <description>At 0x6000.0000</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8000</name>
                  <description>At 0x8000.0000</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HBQS</name>
                  <description>Only to be used with Host Bus quad chip select. In quad chip select mode, CS0n maps to 0x6000.0000 and CS1n maps to 0x8000.0000</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERSZ</name>
              <description>External RAM Size</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_256B</name>
                  <description>256 bytes; lower address range: 0x00 to 0xFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64KB</name>
                  <description>64 KB; lower address range: 0x0000 to 0xFFFF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16MB</name>
                  <description>16 MB; lower address range: 0x00.0000 to 0xFF.FFFF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_256MB</name>
                  <description>256 MB; lower address range: 0x000.0000 to 0xFFF.FFFF</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPADR</name>
              <description>External Peripheral Address</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Not mapped</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A000</name>
                  <description>At 0xA000.0000</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C000</name>
                  <description>At 0xC000.0000</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HBQS</name>
                  <description>Only to be used with Host Bus quad chip select. In quad chip select mode, CS2n maps to 0xA000.0000 and CS3n maps to 0xC000.0000</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPSZ</name>
              <description>External Peripheral Size</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_256B</name>
                  <description>256 bytes; lower address range: 0x00 to 0xFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64KB</name>
                  <description>64 KB; lower address range: 0x0000 to 0xFFFF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16MB</name>
                  <description>16 MB; lower address range: 0x00.0000 to 0xFF.FFFF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_256MB</name>
                  <description>256 MB; lower address range: 0x000.0000 to 0xFFF.FFFF</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECADR</name>
              <description>External Code Address</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Not mapped</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1000</name>
                  <description>At 0x1000.0000</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECSZ</name>
              <description>External Code Size</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_256B</name>
                  <description>256 bytes; lower address range: 0x00 to 0xFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64KB</name>
                  <description>64 KB; lower address range: 0x0000 to 0xFFFF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16MB</name>
                  <description>16 MB; lower address range: 0x00.0000 to 0xFF.FFFF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_256MB</name>
                  <description>256MB; lower address range: 0x000.0000 to 0x0FFF.FFFF</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RSIZE0</name>
          <displayName>EPI_RSIZE0</displayName>
          <description>EPI Read Size 0</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SIZE</name>
              <description>Current Size</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_8BIT</name>
                  <description>Byte (8 bits)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16BIT</name>
                  <description>Half-word (16 bits)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32BIT</name>
                  <description>Word (32 bits)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RADDR0</name>
          <displayName>EPI_RADDR0</displayName>
          <description>EPI Read Address 0</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Current Address</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RPSTD0</name>
          <displayName>EPI_RPSTD0</displayName>
          <description>EPI Non-Blocking Read Data 0</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>POSTCNT</name>
              <description>Post Count</description>
              <lsb>0</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>8191</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RSIZE1</name>
          <displayName>EPI_RSIZE1</displayName>
          <description>EPI Read Size 1</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SIZE</name>
              <description>Current Size</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_8BIT</name>
                  <description>Byte (8 bits)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16BIT</name>
                  <description>Half-word (16 bits)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32BIT</name>
                  <description>Word (32 bits)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RADDR1</name>
          <displayName>EPI_RADDR1</displayName>
          <description>EPI Read Address 1</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Current Address</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RPSTD1</name>
          <displayName>EPI_RPSTD1</displayName>
          <description>EPI Non-Blocking Read Data 1</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>POSTCNT</name>
              <description>Post Count</description>
              <lsb>0</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>8191</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
