m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>STAT</name>
          <displayName>EPI_STAT</displayName>
          <description>EPI Status</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ACTIVE</name>
              <description>Register Active</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NBRBUSY</name>
              <description>Non-Blocking Read Busy</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WBUSY</name>
              <description>Write Busy</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INITSEQ</name>
              <description>Initialization Sequence</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>XFEMPTY</name>
              <description>External FIFO Empty</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>XFFULL</name>
              <description>External FIFO Full</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RFIFOCNT</name>
          <displayName>EPI_RFIFOCNT</displayName>
          <description>EPI Read FIFO Count</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COUNT</name>
              <description>FIFO Count</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO0</name>
          <displayName>EPI_READFIFO0</displayName>
          <description>EPI Read FIFO</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Reads Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO1</name>
          <displayName>EPI_READFIFO1</displayName>
          <description>EPI Read FIFO Alias 1</description>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Reads Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO2</name>
          <displayName>EPI_READFIFO2</displayName>
          <description>EPI Read FIFO Alias 2</description>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Reads Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO3</name>
          <displayName>EPI_READFIFO3</displayName>
          <description>EPI Read FIFO Alias 3</description>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Reads Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO4</name>
          <displayName>EPI_READFIFO4</displayName>
          <description>EPI Read FIFO Alias 4</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Reads Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO5</name>
          <displayName>EPI_READFIFO5</displayName>
          <description>EPI Read FIFO Alias 5</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Reads Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO6</name>
          <displayName>EPI_READFIFO6</displayName>
          <description>EPI Read FIFO Alias 6</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Reads Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO7</name>
          <displayName>EPI_READFIFO7</displayName>
          <description>EPI Read FIFO Alias 7</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Reads Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFOLVL</name>
          <displayName>EPI_FIFOLVL</displayName>
          <description>EPI FIFO Level Selects</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDFIFO</name>
              <description>Read FIFO</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_1</name>
                  <description>Trigger when there are 1 or more entries in the NBRFIFO</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2</name>
                  <description>Trigger when there are 2 or more entries in the NBRFIFO</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4</name>
                  <description>Trigger when there are 4 or more entries in the NBRFIFO</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_6</name>
                  <description>Trigger when there are 6 or more entries in the NBRFIFO</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_7</name>
                  <description>Trigger when there are 7 or more entries in the NBRFIFO</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8</name>
                  <description>Trigger when there are 8 entries in the NBRFIFO</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRFIFO</name>
              <description>Write FIFO</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMPT</name>
                  <description>Interrupt is triggered while WRFIFO is empty.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2</name>
                  <description>Interrupt is triggered until there are only two slots available. Thus, trigger is deasserted when there are two WRFIFO entries present. This configuration is optimized for bursts of 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1</name>
                  <description>Interrupt is triggered until there is one WRFIFO entry available. This configuration expects only single writes</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NFULL</name>
                  <description>Trigger interrupt when WRFIFO is not full, meaning trigger will continue to assert until there are four entries in the WRFIFO</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSERR</name>
              <description>Read Stall Error</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WFERR</name>
              <description>Write Full Error</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>WFIFOCNT</name>
          <displayName>EPI_WFIFOCNT</displayName>
          <description>EPI Write FIFO Count</description>
          <addressOffset>0x00000204</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WTAV</name>
              <description>Available Write Transactions</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMATXCNT</name>
          <displayName>EPI_DMATXCNT</displayName>
          <description>EPI DMA Transmit Count</description>
          <addressOffset>0x00000208</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TXCNT</name>
              <description>DMA Count</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <displayName>EPI_IM</displayName>
          <description>EPI Interrupt Mask</description>
          <addressOffset>0x00000210</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ERRIM</name>
              <description>Error Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RDIM</name>
              <description>Read FIFO Full Interrupt Mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WRIM</name>
              <description>Write FIFO Empty Interrupt Mask</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMARDIM</name>
              <description>Read uDMA Interrupt Mask</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMAWRIM</name>
              <description>Write uDMA Interrupt Mask</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <displayName>EPI_RIS</displayName>
          <description>EPI Raw Interrupt Status</description>
          <addressOffset>0x00000214</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ERRRIS</name>
              <description>Error Raw Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RDRIS</name>
              <description>Read Raw Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WRRIS</name>
              <description>Write Raw Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMARDRIS</name>
              <description>Read uDMA Raw Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMAWRRIS</name>
              <description>Write uDMA Raw Interrupt Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <displayName>EPI_MIS</displayName>
          <description>EPI Masked Interrupt Status</description>
          <addressOffset>0x00000218</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ERRMIS</name>
              <description>Error Masked Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RDMIS</name>
              <description>Read Masked Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WRMIS</name>
              <description>Write Masked Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMARDMIS</name>
              <description>Read uDMA Masked Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMAWRMIS</name>
              <description>Write uDMA Masked Interrupt Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
