m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>HB8CFG4</name>
          <displayName>EPI_HB8CFG4</displayName>
          <description>EPI Host-Bus 8 Configuration 4</description>
          <addressOffset>0x0000030C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MODE</name>
              <description>CS3n Host Bus Sub-Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADMUX</name>
                  <description>ADMUX - AD[7:0]</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AD</name>
                  <description>ADNONMUX - D[7:0]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDWS</name>
              <description>CS3n Read Wait States</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_2</name>
                  <description>Active RDn is 2 EPI clocks</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4</name>
                  <description>Active RDn is 4 EPI clocks</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_6</name>
                  <description>Active RDn is 6 EPI clocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8</name>
                  <description>Active RDn is 8 EPI clocks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRWS</name>
              <description>CS3n Write Wait States</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_2</name>
                  <description>Active WRn is 2 EPI clocks</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4</name>
                  <description>Active WRn is 4 EPI clocks</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_6</name>
                  <description>Active WRn is 6 EPI clocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8</name>
                  <description>Active WRn is 8 EPI clocks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALEHIGH</name>
              <description>CS3n ALE Strobe Polarity</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RDHIGH</name>
              <description>CS2n READ Strobe Polarity</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WRHIGH</name>
              <description>CS3n WRITE Strobe Polarity</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HB8TIME</name>
          <displayName>EPI_HB8TIME</displayName>
          <description>EPI Host-Bus 8 Timing Extension</description>
          <addressOffset>0x00000310</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDWSM</name>
              <description>Read Wait State Minus One</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WRWSM</name>
              <description>Write Wait State Minus One</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CAPWIDTH</name>
              <description>CS0n Inter-transfer Capture Width</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IRDYDLY</name>
              <description>CS0n Input Ready Delay</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HB16TIME</name>
          <displayName>EPI_HB16TIME</displayName>
          <description>EPI Host-Bus 16 Timing Extension</description>
          <addressOffset>0x00000310</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDWSM</name>
              <description>Read Wait State Minus One</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WRWSM</name>
              <description>Write Wait State Minus One</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CAPWIDTH</name>
              <description>CS0n Inter-transfer Capture Width</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PSRAMSZ</name>
              <description>PSRAM Row Size</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_0</name>
                  <description>No row size limitation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_128B</name>
                  <description>128 B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_256B</name>
                  <description>256 B</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_512B</name>
                  <description>512 B</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1KB</name>
                  <description>1024 B</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2KB</name>
                  <description>2048 B</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4KB</name>
                  <description>4096 B</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8KB</name>
                  <description>8192 B</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRDYDLY</name>
              <description>CS0n Input Ready Delay</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HB8TIME2</name>
          <displayName>EPI_HB8TIME2</displayName>
          <description>EPI Host-Bus 8 Timing Extension</description>
          <addressOffset>0x00000314</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDWSM</name>
              <description>CS1n Read Wait State Minus One</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WRWSM</name>
              <description>CS1n Write Wait State Minus One</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CAPWIDTH</name>
              <description>CS1n Inter-transfer Capture Width</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IRDYDLY</name>
              <description>CS1n Input Ready Delay</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HB16TIME2</name>
          <displayName>EPI_HB16TIME2</displayName>
          <description>EPI Host-Bus 16 Timing Extension</description>
          <addressOffset>0x00000314</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDWSM</name>
              <description>CS1n Read Wait State Minus One</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WRWSM</name>
              <description>CS1n Write Wait State Minus One</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CAPWIDTH</name>
              <description>CS1n Inter-transfer Capture Width</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PSRAMSZ</name>
              <description>PSRAM Row Size</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_0</name>
                  <description>No row size limitation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_128B</name>
                  <description>128 B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_256B</name>
                  <description>256 B</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_512B</name>
                  <description>512 B</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1KB</name>
                  <description>1024 B</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2KB</name>
                  <description>2048 B</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4KB</name>
                  <description>4096 B</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8KB</name>
                  <description>8192 B</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRDYDLY</name>
              <description>CS1n Input Ready Delay</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HB16TIME3</name>
          <displayName>EPI_HB16TIME3</displayName>
          <description>EPI Host-Bus 16 Timing Extension</description>
          <addressOffset>0x00000318</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDWSM</name>
              <description>CS2n Read Wait State Minus One</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WRWSM</name>
              <description>CS2n Write Wait State Minus One</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CAPWIDTH</name>
              <description>CS2n Inter-transfer Capture Width</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PSRAMSZ</name>
              <description>PSRAM Row Size</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_0</name>
                  <description>No row size limitation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_128B</name>
                  <description>128 B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_256B</name>
                  <description>256 B</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_512B</name>
                  <description>512 B</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1KB</name>
                  <description>1024 B</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2KB</name>
                  <description>2048 B</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4KB</name>
                  <description>4096 B</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8KB</name>
                  <description>8192 B</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRDYDLY</name>
              <description>CS2n Input Ready Delay</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HB8TIME3</name>
          <displayName>EPI_HB8TIME3</displayName>
          <description>EPI Host-Bus 8 Timing Extension</description>
          <addressOffset>0x00000318</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDWSM</name>
              <description>CS2n Read Wait State Minus One</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WRWSM</name>
              <description>CS2n Write Wait State Minus One</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CAPWIDTH</name>
              <description>CS2n Inter-transfer Capture Width</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IRDYDLY</name>
              <description>CS2n Input Ready Delay</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
