m-labs/dslite2svd/svd/tm4c129x.xml
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/timer.xml -->
    <peripheral derivedFrom="TIMER0">
      <name>TIMER6</name>
      <baseAddress>0x400E0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/timer.xml -->
    <peripheral derivedFrom="TIMER0">
      <name>TIMER7</name>
      <baseAddress>0x400E1000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4c1294ncpdt/emac.xml -->
    <peripheral>
      <name>EMAC0</name>
      <description>EMAC register offsets</description>
      <baseAddress>0x400EC000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>CFG</name>
          <displayName>EMAC_CFG</displayName>
          <description>Ethernet MAC Configuration</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PRELEN</name>
              <description>Preamble Length for Transmit Frames</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_7</name>
                  <description>7 bytes of preamble</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_5</name>
                  <description>5 bytes of preamble</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_3</name>
                  <description>3 bytes of preamble</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RE</name>
              <description>Receiver Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TE</name>
              <description>Transmitter Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DC</name>
              <description>Deferral Check</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BL</name>
              <description>Back-Off Limit</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_1024</name>
                  <description>k = min (n,10)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_256</name>
                  <description>k = min (n,8)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8</name>
                  <description>k = min (n,4)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2</name>
                  <description>k = min (n,1)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACS</name>
              <description>Automatic Pad or CRC Stripping</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DR</name>
              <description>Disable Retry</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IPC</name>
              <description>Checksum Offload</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DUPM</name>
              <description>Duplex Mode</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>LOOPBM</name>
              <description>Loopback Mode</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DRO</name>
              <description>Disable Receive Own</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FES</name>
              <description>Speed</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PS</name>
              <description>Port Select</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DISCRS</name>
              <description>Disable Carrier Sense During Transmission</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IFG</name>
              <description>Inter-Frame Gap (IFG)</description>
              <lsb>17</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_96</name>
                  <description>96 bit times</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_88</name>
                  <description>88 bit times</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_80</name>
                  <description>80 bit times</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_72</name>
                  <description>72 bit times</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64</name>
                  <description>64 bit times</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_56</name>
                  <description>56 bit times</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_48</name>
                  <description>48 bit times</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_40</name>
                  <description>40 bit times</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JFEN</name>
              <description>Jumbo Frame Enable</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>JD</name>
              <description>Jabber Disable</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WDDIS</name>
              <description>Watchdog Disable</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CST</name>
              <description>CRC Stripping for Type Frames</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TWOKPEN</name>
              <description>IEEE 802</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FRAMEFLTR</name>
          <displayName>EMAC_FRAMEFLTR</displayName>
          <description>Ethernet MAC Frame Filter</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PR</name>
              <description>Promiscuous Mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HUC</name>
              <description>Hash Unicast</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HMC</name>
              <description>Hash Multicast</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DAIF</name>
              <description>Destination Address (DA) Inverse Filtering</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PM</name>
              <description>Pass All Multicast</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DBF</name>
              <description>Disable Broadcast Frames</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PCF</name>
              <description>Pass Control Frames</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALL</name>
                  <description>The MAC filters all control frames from reaching application</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAUSE</name>
                  <description>MAC forwards all control frames except PAUSE control frames to application even if they fail the address filter</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>MAC forwards all control frames to application even if they fail the address Filter</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDR</name>
                  <description>MAC forwards control frames that pass the address Filter</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAIF</name>
              <description>Source Address (SA) Inverse Filtering</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SAF</name>
              <description>Source Address Filter Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HPF</name>
              <description>Hash or Perfect Filter</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VTFE</name>
              <description>VLAN Tag Filter Enable</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RA</name>
              <description>Receive All</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHTBLH</name>
          <displayName>EMAC_HASHTBLH</displayName>
          <description>Ethernet MAC Hash Table High</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HTH</name>
              <description>Hash Table High</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHTBLL</name>
          <displayName>EMAC_HASHTBLL</displayName>
          <description>Ethernet MAC Hash Table Low</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HTL</name>
              <description>Hash Table Low</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
