m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>RIS</name>
          <displayName>EMAC_RIS</displayName>
          <description>Ethernet MAC Raw Interrupt Status</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PMT</name>
              <description>PMT Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MMC</name>
              <description>MMC Interrupt Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MMCRX</name>
              <description>MMC Receive Interrupt Status</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MMCTX</name>
              <description>MMC Transmit Interrupt Status</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TS</name>
              <description>Timestamp Interrupt Status</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <displayName>EMAC_IM</displayName>
          <description>Ethernet MAC Interrupt Mask</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PMT</name>
              <description>PMT Interrupt Mask</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TSI</name>
              <description>Timestamp Interrupt Mask</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR0H</name>
          <displayName>EMAC_ADDR0H</displayName>
          <description>Ethernet MAC Address 0 High</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDRHI</name>
              <description>MAC Address0 [47:32]</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>AE</name>
              <description>Address Enable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR0L</name>
          <displayName>EMAC_ADDR0L</displayName>
          <description>Ethernet MAC Address 0 Low Register</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDRLO</name>
              <description>MAC Address0 [31:0]</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR1H</name>
          <displayName>EMAC_ADDR1H</displayName>
          <description>Ethernet MAC Address 1 High</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDRHI</name>
              <description>MAC Address1 [47:32]</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MBC</name>
              <description>Mask Byte Control</description>
              <lsb>24</lsb>
              <msb>29</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SA</name>
              <description>Source Address</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>AE</name>
              <description>Address Enable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR1L</name>
          <displayName>EMAC_ADDR1L</displayName>
          <description>Ethernet MAC Address 1 Low</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDRLO</name>
              <description>MAC Address1 [31:0]</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR2H</name>
          <displayName>EMAC_ADDR2H</displayName>
          <description>Ethernet MAC Address 2 High</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDRHI</name>
              <description>MAC Address2 [47:32]</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MBC</name>
              <description>Mask Byte Control</description>
              <lsb>24</lsb>
              <msb>29</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SA</name>
              <description>Source Address</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>AE</name>
              <description>Address Enable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR2L</name>
          <displayName>EMAC_ADDR2L</displayName>
          <description>Ethernet MAC Address 2 Low</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDRLO</name>
              <description>MAC Address2 [31:0]</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR3H</name>
          <displayName>EMAC_ADDR3H</displayName>
          <description>Ethernet MAC Address 3 High</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDRHI</name>
              <description>MAC Address3 [47:32]</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MBC</name>
              <description>Mask Byte Control</description>
              <lsb>24</lsb>
              <msb>29</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SA</name>
              <description>Source Address</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>AE</name>
              <description>Address Enable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR3L</name>
          <displayName>EMAC_ADDR3L</displayName>
          <description>Ethernet MAC Address 3 Low</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDRLO</name>
              <description>MAC Address3 [31:0]</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>WDOGTO</name>
          <displayName>EMAC_WDOGTO</displayName>
          <description>Ethernet MAC Watchdog Timeout</description>
          <addressOffset>0x000000DC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WTO</name>
              <description>Watchdog Timeout</description>
              <lsb>0</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWE</name>
              <description>Programmable Watchdog Enable</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCCTRL</name>
          <displayName>EMAC_MMCCTRL</displayName>
          <description>Ethernet MAC MMC Control</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNTRST</name>
              <description>Counters Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CNTSTPRO</name>
              <description>Counters Stop Rollover</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RSTONRD</name>
              <description>Reset on Read</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CNTFREEZ</name>
              <description>MMC Counter Freeze</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CNTPRST</name>
              <description>Counters Preset</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CNTPRSTLVL</name>
              <description>Full/Half Preset Level Value</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UCDBC</name>
              <description>Update MMC Counters for Dropped Broadcast Frames</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCRXRIS</name>
          <displayName>EMAC_MMCRXRIS</displayName>
          <description>Ethernet MAC MMC Receive Raw Interrupt Status</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GBF</name>
              <description>MMC Receive Good Bad Frame Counter Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CRCERR</name>
              <description>MMC Receive CRC Error Frame Counter Interrupt Status</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ALGNERR</name>
              <description>MMC Receive Alignment Error Frame Counter Interrupt Status</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UCGF</name>
              <description>MMC Receive Unicast Good Frame Counter Interrupt Status</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCTXRIS</name>
          <displayName>EMAC_MMCTXRIS</displayName>
          <description>Ethernet MAC MMC Transmit Raw Interrupt Status</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GBF</name>
              <description>MMC Transmit Good Bad Frame Counter Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SCOLLGF</name>
              <description>MMC Transmit Single Collision Good Frame Counter Interrupt Status</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MCOLLGF</name>
              <description>MMC Transmit Multiple Collision Good Frame Counter Interrupt Status</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>OCTCNT</name>
              <description>Octet Counter Interrupt Status</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
