m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>MMCRXIM</name>
          <displayName>EMAC_MMCRXIM</displayName>
          <description>Ethernet MAC MMC Receive Interrupt Mask</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GBF</name>
              <description>MMC Receive Good Bad Frame Counter Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CRCERR</name>
              <description>MMC Receive CRC Error Frame Counter Interrupt Mask</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ALGNERR</name>
              <description>MMC Receive Alignment Error Frame Counter Interrupt Mask</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UCGF</name>
              <description>MMC Receive Unicast Good Frame Counter Interrupt Mask</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCTXIM</name>
          <displayName>EMAC_MMCTXIM</displayName>
          <description>Ethernet MAC MMC Transmit Interrupt Mask</description>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GBF</name>
              <description>MMC Transmit Good Bad Frame Counter Interrupt Mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SCOLLGF</name>
              <description>MMC Transmit Single Collision Good Frame Counter Interrupt Mask</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MCOLLGF</name>
              <description>MMC Transmit Multiple Collision Good Frame Counter Interrupt Mask</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>OCTCNT</name>
              <description>MMC Transmit Good Octet Counter Interrupt Mask</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCNTGB</name>
          <displayName>EMAC_TXCNTGB</displayName>
          <description>Ethernet MAC Transmit Frame Count for Good and Bad Frames</description>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TXFRMGB</name>
              <description>This field indicates the number of good and bad frames transmitted, exclusive of retried frames</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCNTSCOL</name>
          <displayName>EMAC_TXCNTSCOL</displayName>
          <description>Ethernet MAC Transmit Frame Count for Frames Transmitted after Single Collision</description>
          <addressOffset>0x0000014C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TXSNGLCOLG</name>
              <description>This field indicates the number of successfully transmitted frames after a single collision in the half-duplex mode</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCNTMCOL</name>
          <displayName>EMAC_TXCNTMCOL</displayName>
          <description>Ethernet MAC Transmit Frame Count for Frames Transmitted after Multiple Collisions</description>
          <addressOffset>0x00000150</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TXMULTCOLG</name>
              <description>This field indicates the number of successfully transmitted frames after multiple collisions in the half-duplex mode</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXOCTCNTG</name>
          <displayName>EMAC_TXOCTCNTG</displayName>
          <description>Ethernet MAC Transmit Octet Count Good</description>
          <addressOffset>0x00000164</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TXOCTG</name>
              <description>This field indicates the number of bytes transmitted, exclusive of preamble, in good frames</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCNTGB</name>
          <displayName>EMAC_RXCNTGB</displayName>
          <description>Ethernet MAC Receive Frame Count for Good and Bad Frames</description>
          <addressOffset>0x00000180</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RXFRMGB</name>
              <description>This field indicates the number of received good and bad frames</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCNTCRCERR</name>
          <displayName>EMAC_RXCNTCRCERR</displayName>
          <description>Ethernet MAC Receive Frame Count for CRC Error Frames</description>
          <addressOffset>0x00000194</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RXCRCERR</name>
              <description>This field indicates the number of frames received with CRC error</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCNTALGNERR</name>
          <displayName>EMAC_RXCNTALGNERR</displayName>
          <description>Ethernet MAC Receive Frame Count for Alignment Error Frames</description>
          <addressOffset>0x00000198</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RXALGNERR</name>
              <description>This field indicates the number of frames received with alignment (dribble) error</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCNTGUNI</name>
          <displayName>EMAC_RXCNTGUNI</displayName>
          <description>Ethernet MAC Receive Frame Count for Good Unicast Frames</description>
          <addressOffset>0x000001C4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RXUCASTG</name>
              <description>This field indicates the number of received good unicast frames</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>VLNINCREP</name>
          <displayName>EMAC_VLNINCREP</displayName>
          <description>Ethernet MAC VLAN Tag Inclusion or Replacement</description>
          <addressOffset>0x00000584</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VLT</name>
              <description>VLAN Tag for Transmit Frames</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VLC</name>
              <description>VLAN Tag Control in Transmit Frames</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No VLAN tag deletion, insertion, or replacement</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TAGDEL</name>
                  <description>VLAN tag deletion</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TAGINS</name>
                  <description>VLAN tag insertion</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TAGREP</name>
                  <description>VLAN tag replacement</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VLP</name>
              <description>VLAN Priority Control</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CSVL</name>
              <description>C-VLAN or S-VLAN</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>VLANHASH</name>
          <displayName>EMAC_VLANHASH</displayName>
          <description>Ethernet MAC VLAN Hash Table</description>
          <addressOffset>0x00000588</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VLHT</name>
              <description>VLAN Hash Table</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSTCTRL</name>
          <displayName>EMAC_TIMSTCTRL</displayName>
          <description>Ethernet MAC Timestamp Control</description>
          <addressOffset>0x00000700</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSEN</name>
              <description>Timestamp Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TSFCUPDT</name>
              <description>Timestamp Fine or Coarse Update</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TSINIT</name>
              <description>Timestamp Initialize</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TSUPDT</name>
              <description>Timestamp Update</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTTRIG</name>
              <description>Timestamp Interrupt Trigger Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ADDREGUP</name>
              <description>Addend Register Update</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ALLF</name>
              <description>Enable Timestamp For All Frames</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DGTLBIN</name>
              <description>Timestamp Digital or Binary Rollover Control</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PTPVER2</name>
              <description>Enable PTP Packet Processing For Version 2 Format</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PTPETH</name>
              <description>Enable Processing of PTP Over Ethernet Frames</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PTPIPV6</name>
              <description>Enable Processing of PTP Frames Sent Over IPv6-UDP</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PTPIPV4</name>
              <description>Enable Processing of PTP Frames Sent over IPv4-UDP</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TSEVNT</name>
              <description>Enable Timestamp Snapshot for Event Messages</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TSMAST</name>
              <description>Enable Snapshot for Messages Relevant to Master</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SELPTP</name>
              <description>Select PTP packets for Taking Snapshots</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PTPFLTR</name>
              <description>Enable MAC address for PTP Frame Filtering</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSECINC</name>
          <displayName>EMAC_SUBSECINC</displayName>
          <description>Ethernet MAC Sub-Second Increment</description>
          <addressOffset>0x00000704</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SSINC</name>
              <description>Sub-second Increment Value</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSEC</name>
          <displayName>EMAC_TIMSEC</displayName>
          <description>Ethernet MAC System Time - Seconds</description>
          <addressOffset>0x00000708</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSS</name>
              <description>Timestamp Second</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
