m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>TIMNANO</name>
          <displayName>EMAC_TIMNANO</displayName>
          <description>Ethernet MAC System Time - Nanoseconds</description>
          <addressOffset>0x0000070C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSSS</name>
              <description>Timestamp Sub-Seconds</description>
              <lsb>0</lsb>
              <msb>30</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2147483647</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSECU</name>
          <displayName>EMAC_TIMSECU</displayName>
          <description>Ethernet MAC System Time - Seconds Update</description>
          <addressOffset>0x00000710</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSS</name>
              <description>Timestamp Second</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMNANOU</name>
          <displayName>EMAC_TIMNANOU</displayName>
          <description>Ethernet MAC System Time - Nanoseconds Update</description>
          <addressOffset>0x00000714</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSSS</name>
              <description>Timestamp Sub-Second</description>
              <lsb>0</lsb>
              <msb>30</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2147483647</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ADDSUB</name>
              <description>Add or subtract time</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMADD</name>
          <displayName>EMAC_TIMADD</displayName>
          <description>Ethernet MAC Timestamp Addend</description>
          <addressOffset>0x00000718</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSAR</name>
              <description>Timestamp Addend Register</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TARGSEC</name>
          <displayName>EMAC_TARGSEC</displayName>
          <description>Ethernet MAC Target Time Seconds</description>
          <addressOffset>0x0000071C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSTR</name>
              <description>Target Time Seconds Register</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TARGNANO</name>
          <displayName>EMAC_TARGNANO</displayName>
          <description>Ethernet MAC Target Time Nanoseconds</description>
          <addressOffset>0x00000720</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TTSLO</name>
              <description>Target Timestamp Low Register</description>
              <lsb>0</lsb>
              <msb>30</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2147483647</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRGTBUSY</name>
              <description>Target Time Register Busy</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HWORDSEC</name>
          <displayName>EMAC_HWORDSEC</displayName>
          <description>Ethernet MAC System Time-Higher Word Seconds</description>
          <addressOffset>0x00000724</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSHWR</name>
              <description>Target Timestamp Higher Word Register</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSTAT</name>
          <displayName>EMAC_TIMSTAT</displayName>
          <description>Ethernet MAC Timestamp Status</description>
          <addressOffset>0x00000728</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSSOVF</name>
              <description>Timestamp Seconds Overflow</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TSTARGT</name>
              <description>Timestamp Target Time Reached</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PPSCTRL</name>
          <displayName>EMAC_PPSCTRL</displayName>
          <description>Ethernet MAC PPS Control</description>
          <addressOffset>0x0000072C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PPSCTRL</name>
              <description>EN0PPS Output Frequency Control (PPSCTRL) or Command Control (PPSCMD)</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PPSEN0</name>
              <description>Flexible PPS Output Mode Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRGMODS0</name>
              <description>Target Time Register Mode for PPS0 Output</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTONLY</name>
                  <description>Indicates that the Target Time registers are programmed only for generating the interrupt event</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTPPS0</name>
                  <description>Indicates that the Target Time registers are programmed for generating the interrupt event and starting or stopping the generation of the EN0PPS output signal</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PPS0ONLY</name>
                  <description>Indicates that the Target Time registers are programmed only for starting or stopping the generation of the EN0PPS output signal. No interrupt is asserted</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PPS0INTVL</name>
          <displayName>EMAC_PPS0INTVL</displayName>
          <description>Ethernet MAC PPS0 Interval</description>
          <addressOffset>0x00000760</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PPS0INT</name>
              <description>PPS0 Output Signal Interval</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PPS0WIDTH</name>
          <displayName>EMAC_PPS0WIDTH</displayName>
          <description>Ethernet MAC PPS0 Width</description>
          <addressOffset>0x00000764</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_PPS0WIDTH</name>
              <description>EN0PPS Output Signal Width</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMABUSMOD</name>
          <displayName>EMAC_DMABUSMOD</displayName>
          <description>Ethernet MAC DMA Bus Mode</description>
          <addressOffset>0x00000C00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SWR</name>
              <description>DMA Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DA</name>
              <description>DMA Arbitration Scheme</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DSL</name>
              <description>Descriptor Skip Length</description>
              <lsb>2</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ATDS</name>
              <description>Alternate Descriptor Size</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PBL</name>
              <description>Programmable Burst Length</description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PR</name>
              <description>Priority Ratio</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FB</name>
              <description>Fixed Burst</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RPBL</name>
              <description>RX DMA Programmable Burst Length (PBL)</description>
              <lsb>17</lsb>
              <msb>22</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>USP</name>
              <description>Use Separate Programmable Burst Length (PBL)</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>_8XPBL</name>
              <description>8 x Programmable Burst Length (PBL) Mode</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>AAL</name>
              <description>Address Aligned Beats</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MB</name>
              <description>Mixed Burst</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXPR</name>
              <description>Transmit Priority</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RIB</name>
              <description>Rebuild Burst</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXPOLLD</name>
          <displayName>EMAC_TXPOLLD</displayName>
          <description>Ethernet MAC Transmit Poll Demand</description>
          <addressOffset>0x00000C04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TPD</name>
              <description>Transmit Poll Demand</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXPOLLD</name>
          <displayName>EMAC_RXPOLLD</displayName>
          <description>Ethernet MAC Receive Poll Demand</description>
          <addressOffset>0x00000C08</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RPD</name>
              <description>Receive Poll Demand</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDLADDR</name>
          <displayName>EMAC_RXDLADDR</displayName>
          <description>Ethernet MAC Receive Descriptor List Address</description>
          <addressOffset>0x00000C0C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STRXLIST</name>
              <description>Start of Receive List</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1073741823</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDLADDR</name>
          <displayName>EMAC_TXDLADDR</displayName>
          <description>Ethernet MAC Transmit Descriptor List Address</description>
          <addressOffset>0x00000C10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TXDLADDR</name>
              <description>Start of Transmit List Base Address</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1073741823</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
