m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>DMARIS</name>
          <displayName>EMAC_DMARIS</displayName>
          <description>Ethernet MAC DMA Interrupt Status</description>
          <addressOffset>0x00000C14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TI</name>
              <description>Transmit Interrupt</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TPS</name>
              <description>Transmit Process Stopped</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TU</name>
              <description>Transmit Buffer Unavailable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TJT</name>
              <description>Transmit Jabber Timeout</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>OVF</name>
              <description>Receive Overflow</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UNF</name>
              <description>Transmit Underflow</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RI</name>
              <description>Receive Interrupt</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RU</name>
              <description>Receive Buffer Unavailable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RPS</name>
              <description>Receive Process Stopped</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RWT</name>
              <description>Receive Watchdog Timeout</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ETI</name>
              <description>Early Transmit Interrupt</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FBI</name>
              <description>Fatal Bus Error Interrupt</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ERI</name>
              <description>Early Receive Interrupt</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>AIS</name>
              <description>Abnormal Interrupt Summary</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NIS</name>
              <description>Normal Interrupt Summary</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RS</name>
              <description>Received Process State</description>
              <lsb>17</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stopped: Reset or stop receive command issued</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNRXTD</name>
                  <description>Running: Fetching receive transfer descriptor</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNRXD</name>
                  <description>Running: Waiting for receive packet</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUSPEND</name>
                  <description>Suspended: Receive descriptor unavailable</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNCRD</name>
                  <description>Running: Closing receive descriptor</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSWS</name>
                  <description>Writing Timestamp</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNTXD</name>
                  <description>Running: Transferring the receive packet data from receive buffer to host memory</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TS</name>
              <description>Transmit Process State</description>
              <lsb>20</lsb>
              <msb>22</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stopped; Reset or Stop transmit command processed</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNTXTD</name>
                  <description>Running; Fetching transmit transfer descriptor</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATUS</name>
                  <description>Running; Waiting for status</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNTX</name>
                  <description>Running; Reading data from host memory buffer and queuing it to transmit buffer (TX FIFO)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSTAMP</name>
                  <description>Writing Timestamp</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUSPEND</name>
                  <description>Suspended; Transmit descriptor unavailable or transmit buffer underflow</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNCTD</name>
                  <description>Running; Closing transmit descriptor</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AE</name>
              <description>Access Error</description>
              <lsb>23</lsb>
              <msb>25</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXDMAWD</name>
                  <description>Error during RX DMA Write Data Transfer</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXDMARD</name>
                  <description>Error during TX DMA Read Data Transfer</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXDMADW</name>
                  <description>Error during RX DMA Descriptor Write Access</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXDMADW</name>
                  <description>Error during TX DMA Descriptor Write Access</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXDMADR</name>
                  <description>Error during RX DMA Descriptor Read Access</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXDMADR</name>
                  <description>Error during TX DMA Descriptor Read Access</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MMC</name>
              <description>MAC MMC Interrupt</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PMT</name>
              <description>MAC PMT Interrupt Status</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TT</name>
              <description>Timestamp Trigger Interrupt Status</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAOPMODE</name>
          <displayName>EMAC_DMAOPMODE</displayName>
          <description>Ethernet MAC DMA Operation Mode</description>
          <addressOffset>0x00000C18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SR</name>
              <description>Start or Stop Receive</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>OSF</name>
              <description>Operate on Second Frame</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RTC</name>
              <description>Receive Threshold Control</description>
              <lsb>3</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_64</name>
                  <description>64 bytes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32</name>
                  <description>32 bytes</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_96</name>
                  <description>96 bytes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_128</name>
                  <description>128 bytes</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DGF</name>
              <description>Drop Giant Frame Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FUF</name>
              <description>Forward Undersized Good Frames</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FEF</name>
              <description>Forward Error Frames</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ST</name>
              <description>Start or Stop Transmission Command</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TTC</name>
              <description>Transmit Threshold Control</description>
              <lsb>14</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_64</name>
                  <description>64 bytes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_128</name>
                  <description>128 bytes</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_192</name>
                  <description>192 bytes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_256</name>
                  <description>256 bytes</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_40</name>
                  <description>40 bytes</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32</name>
                  <description>32 bytes</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_24</name>
                  <description>24 bytes</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16</name>
                  <description>16 bytes</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FTF</name>
              <description>Flush Transmit FIFO</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TSF</name>
              <description>Transmit Store and Forward</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DFF</name>
              <description>Disable Flushing of Received Frames</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RSF</name>
              <description>Receive Store and Forward</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DT</name>
              <description>Disable Dropping of TCP/IP Checksum Error Frames</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
