m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>DMAIM</name>
          <displayName>EMAC_DMAIM</displayName>
          <description>Ethernet MAC DMA Interrupt Mask Register</description>
          <addressOffset>0x00000C1C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIE</name>
              <description>Transmit Interrupt Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TSE</name>
              <description>Transmit Stopped Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TUE</name>
              <description>Transmit Buffer Unvailable Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TJE</name>
              <description>Transmit Jabber Timeout Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>OVE</name>
              <description>Overflow Interrupt Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UNE</name>
              <description>Underflow Interrupt Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RIE</name>
              <description>Receive Interrupt Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RUE</name>
              <description>Receive Buffer Unavailable Enable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RSE</name>
              <description>Receive Stopped Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RWE</name>
              <description>Receive Watchdog Timeout Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ETE</name>
              <description>Early Transmit Interrupt Enable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FBE</name>
              <description>Fatal Bus Error Enable</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ERE</name>
              <description>Early Receive Interrupt Enable</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>AIE</name>
              <description>Abnormal Interrupt Summary Enable</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NIE</name>
              <description>Normal Interrupt Summary Enable</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MFBOC</name>
          <displayName>EMAC_MFBOC</displayName>
          <description>Ethernet MAC Missed Frame and Buffer Overflow Counter</description>
          <addressOffset>0x00000C20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MISFRMCNT</name>
              <description>Missed Frame Counter</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MISCNTOVF</name>
              <description>Overflow bit for Missed Frame Counter</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>OVFFRMCNT</name>
              <description>Overflow Frame Counter</description>
              <lsb>17</lsb>
              <msb>27</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>OVFCNTOVF</name>
              <description>Overflow Bit for FIFO Overflow Counter</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXINTWDT</name>
          <displayName>EMAC_RXINTWDT</displayName>
          <description>Ethernet MAC Receive Interrupt Watchdog Timer</description>
          <addressOffset>0x00000C24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RIWT</name>
              <description>Receive Interrupt Watchdog Timer Count</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HOSTXDESC</name>
          <displayName>EMAC_HOSTXDESC</displayName>
          <description>Ethernet MAC Current Host Transmit Descriptor</description>
          <addressOffset>0x00000C48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CURTXDESC</name>
              <description>Host Transmit Descriptor Address Pointer</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HOSRXDESC</name>
          <displayName>EMAC_HOSRXDESC</displayName>
          <description>Ethernet MAC Current Host Receive Descriptor</description>
          <addressOffset>0x00000C4C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CURRXDESC</name>
              <description>Host Receive Descriptor Address Pointer</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HOSTXBA</name>
          <displayName>EMAC_HOSTXBA</displayName>
          <description>Ethernet MAC Current Host Transmit Buffer Address</description>
          <addressOffset>0x00000C50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CURTXBUFA</name>
              <description>Host Transmit Buffer Address Pointer</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HOSRXBA</name>
          <displayName>EMAC_HOSRXBA</displayName>
          <description>Ethernet MAC Current Host Receive Buffer Address</description>
          <addressOffset>0x00000C54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CURRXBUFA</name>
              <description>Host Receive Buffer Address Pointer</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <displayName>EMAC_PP</displayName>
          <description>Ethernet MAC Peripheral Property Register</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PHYTYPE</name>
              <description>Ethernet PHY Type</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No PHY</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1</name>
                  <description>Snowflake class PHY</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MACTYPE</name>
              <description>Ethernet MAC Type</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
