m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>PC</name>
          <displayName>EMAC_PC</displayName>
          <description>Ethernet MAC Peripheral Configuration Register</description>
          <addressOffset>0x00000FC4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PHYHOLD</name>
              <description>Ethernet PHY Hold</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ANMODE</name>
              <description>Auto Negotiation Mode</description>
              <lsb>1</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_10HD</name>
                  <description>When ANEN = 0x0, the mode is 10Base-T, Half-Duplex</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_10FD</name>
                  <description>When ANEN = 0x0, the mode is 10Base-T, Full-Duplex</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_100HD</name>
                  <description>When ANEN = 0x0, the mode is 100Base-TX, Half-Duplex</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_100FD</name>
                  <description>When ANEN = 0x0, the mode is 100Base-TX, Full-Duplex</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANEN</name>
              <description>Auto Negotiation Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FASTANSEL</name>
              <description>Fast Auto Negotiation Select</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FASTANEN</name>
              <description>Fast Auto Negotiation Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EXTFD</name>
              <description>Extended Full Duplex Ability</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FASTLUPD</name>
              <description>FAST Link-Up in Parallel Detect</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FASTRXDV</name>
              <description>Fast RXDV Detection</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MDIXEN</name>
              <description>MDIX Enable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FASTMDIX</name>
              <description>Fast Auto MDI-X</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RBSTMDIX</name>
              <description>Robust Auto MDI-X</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MDISWAP</name>
              <description>MDI Swap</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>POLSWAP</name>
              <description>Polarity Swap</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FASTLDMODE</name>
              <description>Fast Link Down Mode</description>
              <lsb>15</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TDRRUN</name>
              <description>TDR Auto Run</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>LRR</name>
              <description>Link Loss Recovery</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ISOMIILL</name>
              <description>Isolate MII in Link Loss</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RXERIDLE</name>
              <description>RXER Detection During Idle</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NIBDETDIS</name>
              <description>Odd Nibble TXER Detection Disable</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DIGRESTART</name>
              <description>PHY Soft Restart</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PINTFS</name>
              <description>Ethernet Interface Select</description>
              <lsb>28</lsb>
              <msb>30</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMII</name>
                  <description>MII (default) Used for internal PHY or external PHY connected via MII</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RMII</name>
                  <description>RMII: Used for external PHY connected via RMII</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHYEXT</name>
              <description>PHY Select</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CC</name>
          <displayName>EMAC_CC</displayName>
          <description>Ethernet MAC Clock Configuration Register</description>
          <addressOffset>0x00000FC8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>POL</name>
              <description>LED Polarity Control</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PTPCEN</name>
              <description>PTP Clock Reference Enable</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EPHYRIS</name>
          <displayName>EMAC_EPHYRIS</displayName>
          <description>Ethernet PHY Raw Interrupt Status</description>
          <addressOffset>0x00000FD0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT</name>
              <description>Ethernet PHY Raw Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EPHYIM</name>
          <displayName>EMAC_EPHYIM</displayName>
          <description>Ethernet PHY Interrupt Mask</description>
          <addressOffset>0x00000FD4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT</name>
              <description>Ethernet PHY Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EPHYMISC</name>
          <displayName>EMAC_EPHYMISC</displayName>
          <description>Ethernet PHY Masked Interrupt Status and Clear</description>
          <addressOffset>0x00000FD8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT</name>
              <description>Ethernet PHY Status and Clear register</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
