m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>RTCT</name>
          <displayName>HIB_RTCT</displayName>
          <description>Hibernation RTC Trim</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TRIM</name>
              <description>RTC Trim Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCSS</name>
          <displayName>HIB_RTCSS</displayName>
          <description>Hibernation RTC Sub Seconds</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RTCSSC</name>
              <description>RTC Sub Seconds Count</description>
              <lsb>0</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>32767</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RTCSSM</name>
              <description>RTC Sub Seconds Match</description>
              <lsb>16</lsb>
              <msb>30</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>32767</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IO</name>
          <displayName>HIB_IO</displayName>
          <description>Hibernation IO Configuration</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WUUNLK</name>
              <description>I/O Wake Pad Configuration Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WURSTEN</name>
              <description>Reset Wake Source Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IOWRC</name>
              <description>I/O Write Complete</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA</name>
          <displayName>HIB_DATA</displayName>
          <description>Hibernation Data</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RTD</name>
              <description>Hibernation Module NV Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CALCTL</name>
          <displayName>HIB_CALCTL</displayName>
          <description>Hibernation Calendar Control</description>
          <addressOffset>0x00000300</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CALEN</name>
              <description>RTC Calendar/Counter Mode Select</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CAL24</name>
              <description>Calendar Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CAL0</name>
          <displayName>HIB_CAL0</displayName>
          <description>Hibernation Calendar 0</description>
          <addressOffset>0x00000310</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEC</name>
              <description>Seconds</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MIN</name>
              <description>Minutes</description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HR</name>
              <description>Hours</description>
              <lsb>16</lsb>
              <msb>20</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>AMPM</name>
              <description>AM/PM Designation</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VALID</name>
              <description>Valid Calendar Load</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CAL1</name>
          <displayName>HIB_CAL1</displayName>
          <description>Hibernation Calendar 1</description>
          <addressOffset>0x00000314</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DOM</name>
              <description>Day of Month</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MON</name>
              <description>Month</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>YEAR</name>
              <description>Year Value</description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DOW</name>
              <description>Day of Week</description>
              <lsb>24</lsb>
              <msb>26</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VALID</name>
              <description>Valid Calendar Load</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CALLD0</name>
          <displayName>HIB_CALLD0</displayName>
          <description>Hibernation Calendar Load 0</description>
          <addressOffset>0x00000320</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEC</name>
              <description>Seconds</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MIN</name>
              <description>Minutes</description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HR</name>
              <description>Hours</description>
              <lsb>16</lsb>
              <msb>20</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>AMPM</name>
              <description>AM/PM Designation</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CALLD1</name>
          <displayName>HIB_CALLD1</displayName>
          <description>Hibernation Calendar Load</description>
          <addressOffset>0x00000324</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DOM</name>
              <description>Day of Month</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MON</name>
              <description>Month</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>YEAR</name>
              <description>Year Value</description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DOW</name>
              <description>Day of Week</description>
              <lsb>24</lsb>
              <msb>26</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CALM0</name>
          <displayName>HIB_CALM0</displayName>
          <description>Hibernation Calendar Match 0</description>
          <addressOffset>0x00000330</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEC</name>
              <description>Seconds</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MIN</name>
              <description>Minutes</description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HR</name>
              <description>Hours</description>
              <lsb>16</lsb>
              <msb>20</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>AMPM</name>
              <description>AM/PM Designation</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CALM1</name>
          <displayName>HIB_CALM1</displayName>
          <description>Hibernation Calendar Match 1</description>
          <addressOffset>0x00000334</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DOM</name>
              <description>Day of Month</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCK</name>
          <displayName>HIB_LOCK</displayName>
          <description>Hibernation Lock</description>
          <addressOffset>0x00000360</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIBLOCK</name>
              <description>HIbernate Lock</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TPCTL</name>
          <displayName>HIB_TPCTL</displayName>
          <description>HIB Tamper Control</description>
          <addressOffset>0x00000400</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TPEN</name>
              <description>Tamper Module Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TPCLR</name>
              <description>Tamper Event Clear</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MEMCLR</name>
              <description>HIB Memory Clear on Tamper Event</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do not Clear HIB memory on tamper event</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW32</name>
                  <description>Clear Lower 32 Bytes of HIB memory on tamper event</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH32</name>
                  <description>Clear upper 32 Bytes of HIB memory on tamper event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL</name>
                  <description>Clear all HIB memory on tamper event</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAKE</name>
              <description>Wake from Hibernate on a Tamper Event</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TPSTAT</name>
          <displayName>HIB_TPSTAT</displayName>
          <description>HIB Tamper Status</description>
          <addressOffset>0x00000404</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XOSCFAIL</name>
              <description>External Oscillator Failure</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>XOSCST</name>
              <description>External Oscillator Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>STATE</name>
              <description>Tamper Module Status</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Tamper disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONFIGED</name>
                  <description>Tamper configured</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description>Tamper pin event occurred</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
