m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>CONF</name>
          <displayName>FLASH_CONF</displayName>
          <description>Flash Configuration Register</description>
          <addressOffset>0x00000FC8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FPFOFF</name>
              <description>Force Prefetch Off</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FPFON</name>
              <description>Force Prefetch On</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CLRTV</name>
              <description>Clear Valid Tags</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SPFE</name>
              <description>Single Prefetch Mode Enable</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FMME</name>
              <description>Flash Mirror Mode Enable</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ROMSWMAP</name>
          <displayName>FLASH_ROMSWMAP</displayName>
          <description>ROM Software Map</description>
          <addressOffset>0x00000FCC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SW0EN</name>
              <description>ROM SW Region 0 Availability</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTVIS</name>
                  <description>Software region not available to the core</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORE</name>
                  <description>Region available to core</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW1EN</name>
              <description>ROM SW Region 1 Availability</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTVIS</name>
                  <description>Software region not available to the core</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORE</name>
                  <description>Region available to core</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW2EN</name>
              <description>ROM SW Region 2 Availability</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTVIS</name>
                  <description>Software region not available to the core</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORE</name>
                  <description>Region available to core</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW3EN</name>
              <description>ROM SW Region 3 Availability</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTVIS</name>
                  <description>Software region not available to the core</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORE</name>
                  <description>Region available to core</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW4EN</name>
              <description>ROM SW Region 4 Availability</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTVIS</name>
                  <description>Software region not available to the core</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORE</name>
                  <description>Region available to core</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW5EN</name>
              <description>ROM SW Region 5 Availability</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTVIS</name>
                  <description>Software region not available to the core</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORE</name>
                  <description>Region available to core</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW6EN</name>
              <description>ROM SW Region 6 Availability</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTVIS</name>
                  <description>Software region not available to the core</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORE</name>
                  <description>Region available to core</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW7EN</name>
              <description>ROM SW Region 7 Availability</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTVIS</name>
                  <description>Software region not available to the core</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORE</name>
                  <description>Region available to core</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMASZ</name>
          <displayName>FLASH_DMASZ</displayName>
          <description>Flash DMA Address Size</description>
          <addressOffset>0x00000FD0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SIZE</name>
              <description>uDMA-accessible Memory Size</description>
              <lsb>0</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>262143</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAST</name>
          <displayName>FLASH_DMAST</displayName>
          <description>Flash DMA Starting Address</description>
          <addressOffset>0x00000FD4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Contains the starting address of the flash region accessible by uDMA if the FLASHPP register DFA bit is set</description>
              <lsb>11</lsb>
              <msb>28</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>262143</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RVP</name>
          <displayName>FLASH_RVP</displayName>
          <description>Reset Vector Pointer</description>
          <addressOffset>0x000010D4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RV</name>
              <description>Reset Vector Pointer Address</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTCFG</name>
          <displayName>FLASH_BOOTCFG</displayName>
          <description>Boot Configuration</description>
          <addressOffset>0x000011D0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DBG0</name>
              <description>Debug Control 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DBG1</name>
              <description>Debug Control 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>KEY</name>
              <description>KEY Select</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EN</name>
              <description>Boot GPIO Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>POL</name>
              <description>Boot GPIO Polarity</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PIN</name>
              <description>Boot GPIO Pin</description>
              <lsb>10</lsb>
              <msb>12</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_0</name>
                  <description>Pin 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1</name>
                  <description>Pin 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2</name>
                  <description>Pin 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_3</name>
                  <description>Pin 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4</name>
                  <description>Pin 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_5</name>
                  <description>Pin 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_6</name>
                  <description>Pin 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_7</name>
                  <description>Pin 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT</name>
              <description>Boot GPIO Port</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A</name>
                  <description>Port A</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>Port B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C</name>
                  <description>Port C</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D</name>
                  <description>Port D</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E</name>
                  <description>Port E</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>F</name>
                  <description>Port F</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>G</name>
                  <description>Port G</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H</name>
                  <description>Port H</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NW</name>
              <description>Not Written</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>USERREG0</name>
          <displayName>FLASH_USERREG0</displayName>
          <description>User Register 0</description>
          <addressOffset>0x000011E0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>User Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>USERREG1</name>
          <displayName>FLASH_USERREG1</displayName>
          <description>User Register 1</description>
          <addressOffset>0x000011E4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>User Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>USERREG2</name>
          <displayName>FLASH_USERREG2</displayName>
          <description>User Register 2</description>
          <addressOffset>0x000011E8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>User Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>USERREG3</name>
          <displayName>FLASH_USERREG3</displayName>
          <description>User Register 3</description>
          <addressOffset>0x000011EC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>User Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FMPRE0</name>
          <displayName>FLASH_FMPRE0</displayName>
          <description>Flash Memory Protection Read Enable 0</description>
          <addressOffset>0x00001200</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FMPRE1</name>
          <displayName>FLASH_FMPRE1</displayName>
          <description>Flash Memory Protection Read Enable 1</description>
          <addressOffset>0x00001204</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FMPRE2</name>
          <displayName>FLASH_FMPRE2</displayName>
          <description>Flash Memory Protection Read Enable 2</description>
          <addressOffset>0x00001208</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FMPRE3</name>
          <displayName>FLASH_FMPRE3</displayName>
          <description>Flash Memory Protection Read Enable 3</description>
          <addressOffset>0x0000120C</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FMPRE4</name>
          <displayName>FLASH_FMPRE4</displayName>
          <description>Flash Memory Protection Read Enable 4</description>
          <addressOffset>0x00001210</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FMPRE5</name>
          <displayName>FLASH_FMPRE5</displayName>
          <description>Flash Memory Protection Read Enable 5</description>
          <addressOffset>0x00001214</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FMPRE6</name>
          <displayName>FLASH_FMPRE6</displayName>
          <description>Flash Memory Protection Read Enable 6</description>
          <addressOffset>0x00001218</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FMPRE7</name>
          <displayName>FLASH_FMPRE7</displayName>
          <description>Flash Memory Protection Read Enable 7</description>
          <addressOffset>0x0000121C</addressOffset>
          <size>32</size>
        </register>
