m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>FMPRE8</name>
          <displayName>FLASH_FMPRE8</displayName>
          <description>Flash Memory Protection Read Enable 8</description>
          <addressOffset>0x00001220</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>READ_ENABLE</name>
              <description>Flash Read Enable</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FMPRE9</name>
          <displayName>FLASH_FMPRE9</displayName>
          <description>Flash Memory Protection Read Enable 9</description>
          <addressOffset>0x00001224</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>READ_ENABLE</name>
              <description>Flash Read Enable</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FMPRE10</name>
          <displayName>FLASH_FMPRE10</displayName>
          <description>Flash Memory Protection Read Enable 10</description>
          <addressOffset>0x00001228</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>READ_ENABLE</name>
              <description>Flash Read Enable</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FMPRE11</name>
          <displayName>FLASH_FMPRE11</displayName>
          <description>Flash Memory Protection Read Enable 11</description>
          <addressOffset>0x0000122C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>READ_ENABLE</name>
              <description>Flash Read Enable</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FMPRE12</name>
          <displayName>FLASH_FMPRE12</displayName>
          <description>Flash Memory Protection Read Enable 12</description>
          <addressOffset>0x00001230</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>READ_ENABLE</name>
              <description>Flash Read Enable</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FMPRE13</name>
          <displayName>FLASH_FMPRE13</displayName>
          <description>Flash Memory Protection Read Enable 13</description>
          <addressOffset>0x00001234</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>READ_ENABLE</name>
              <description>Flash Read Enable</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FMPRE14</name>
          <displayName>FLASH_FMPRE14</displayName>
          <description>Flash Memory Protection Read Enable 14</description>
          <addressOffset>0x00001238</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>READ_ENABLE</name>
              <description>Flash Read Enable</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FMPRE15</name>
          <displayName>FLASH_FMPRE15</displayName>
          <description>Flash Memory Protection Read Enable 15</description>
          <addressOffset>0x0000123C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>READ_ENABLE</name>
              <description>Flash Read Enable</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FMPPE0</name>
          <displayName>FLASH_FMPPE0</displayName>
          <description>Flash Memory Protection Program Enable 0</description>
          <addressOffset>0x00001400</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FMPPE1</name>
          <displayName>FLASH_FMPPE1</displayName>
          <description>Flash Memory Protection Program Enable 1</description>
          <addressOffset>0x00001404</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FMPPE2</name>
          <displayName>FLASH_FMPPE2</displayName>
          <description>Flash Memory Protection Program Enable 2</description>
          <addressOffset>0x00001408</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FMPPE3</name>
          <displayName>FLASH_FMPPE3</displayName>
          <description>Flash Memory Protection Program Enable 3</description>
          <addressOffset>0x0000140C</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FMPPE4</name>
          <displayName>FLASH_FMPPE4</displayName>
          <description>Flash Memory Protection Program Enable 4</description>
          <addressOffset>0x00001410</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FMPPE5</name>
          <displayName>FLASH_FMPPE5</displayName>
          <description>Flash Memory Protection Program Enable 5</description>
          <addressOffset>0x00001414</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FMPPE6</name>
          <displayName>FLASH_FMPPE6</displayName>
          <description>Flash Memory Protection Program Enable 6</description>
          <addressOffset>0x00001418</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FMPPE7</name>
          <displayName>FLASH_FMPPE7</displayName>
          <description>Flash Memory Protection Program Enable 7</description>
          <addressOffset>0x0000141C</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FMPPE8</name>
          <displayName>FLASH_FMPPE8</displayName>
          <description>Flash Memory Protection Program Enable 8</description>
          <addressOffset>0x00001420</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PROG_ENABLE</name>
              <description>Flash Programming Enable</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FMPPE9</name>
          <displayName>FLASH_FMPPE9</displayName>
          <description>Flash Memory Protection Program Enable 9</description>
          <addressOffset>0x00001424</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PROG_ENABLE</name>
              <description>Flash Programming Enable</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FMPPE10</name>
          <displayName>FLASH_FMPPE10</displayName>
          <description>Flash Memory Protection Program Enable 10</description>
          <addressOffset>0x00001428</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PROG_ENABLE</name>
              <description>Flash Programming Enable</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FMPPE11</name>
          <displayName>FLASH_FMPPE11</displayName>
          <description>Flash Memory Protection Program Enable 11</description>
          <addressOffset>0x0000142C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PROG_ENABLE</name>
              <description>Flash Programming Enable</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FMPPE12</name>
          <displayName>FLASH_FMPPE12</displayName>
          <description>Flash Memory Protection Program Enable 12</description>
          <addressOffset>0x00001430</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PROG_ENABLE</name>
              <description>Flash Programming Enable</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FMPPE13</name>
          <displayName>FLASH_FMPPE13</displayName>
          <description>Flash Memory Protection Program Enable 13</description>
          <addressOffset>0x00001434</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PROG_ENABLE</name>
              <description>Flash Programming Enable</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FMPPE14</name>
          <displayName>FLASH_FMPPE14</displayName>
          <description>Flash Memory Protection Program Enable 14</description>
          <addressOffset>0x00001438</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PROG_ENABLE</name>
              <description>Flash Programming Enable</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FMPPE15</name>
          <displayName>FLASH_FMPPE15</displayName>
          <description>Flash Memory Protection Program Enable 15</description>
          <addressOffset>0x0000143C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PROG_ENABLE</name>
              <description>Flash Programming Enable</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
