m-labs/dslite2svd/svd/tm4c129x.xml
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/tm4c1294kcpdt/sysctl.xml -->
    <peripheral>
      <name>SYSCTL</name>
      <description>System Control register addresses</description>
      <baseAddress>0x400FE000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>DID0</name>
          <displayName>SYSCTL_DID0</displayName>
          <description>Device Identification 0</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MIN</name>
              <description>Minor Revision</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_0</name>
                  <description>Initial device, or a major revision update</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1</name>
                  <description>First metal layer change</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2</name>
                  <description>Second metal layer change</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAJ</name>
              <description>Major Revision</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REVA</name>
                  <description>Revision A (initial device)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REVB</name>
                  <description>Revision B (first base layer revision)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REVC</name>
                  <description>Revision C (second base layer revision)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLASS</name>
              <description>Device Class</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TM4C129</name>
                  <description>Tiva(TM) TM4C129-class microcontrollers</description>
                  <value>0xa</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VER</name>
              <description>DID0 Version</description>
              <lsb>28</lsb>
              <msb>30</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_1</name>
                  <description>Second version of the DID0 register format.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DID1</name>
          <displayName>SYSCTL_DID1</displayName>
          <description>Device Identification 1</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>QUAL</name>
              <description>Qualification Status</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ES</name>
                  <description>Engineering Sample (unqualified)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PP</name>
                  <description>Pilot Production (unqualified)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FQ</name>
                  <description>Fully Qualified</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ROHS</name>
              <description>RoHS-Compliance</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PKG</name>
              <description>Package Type</description>
              <lsb>3</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QFP</name>
                  <description>QFP package</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BGA</name>
                  <description>BGA package</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEMP</name>
              <description>Temperature Range</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>C</name>
                  <description>Commercial temperature range</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I</name>
                  <description>Industrial temperature range</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E</name>
                  <description>Extended temperature range</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINCNT</name>
              <description>Package Pin Count</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_100</name>
                  <description>100-pin LQFP package</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64</name>
                  <description>64-pin LQFP package</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_144</name>
                  <description>144-pin LQFP package</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_157</name>
                  <description>157-pin BGA package</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_128</name>
                  <description>128-pin TQFP package</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRTNO</name>
              <description>Part Number</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FAM</name>
              <description>Family</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VER</name>
              <description>DID1 Version</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PTBOCTL</name>
          <displayName>SYSCTL_PTBOCTL</displayName>
          <description>Power-Temp Brown Out Control</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VDD_UBOR</name>
              <description>VDD (VDDS) under BOR Event Action</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No Action</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSINT</name>
                  <description>System control interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NMI</name>
                  <description>NMI</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RST</name>
                  <description>Reset</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDA_UBOR</name>
              <description>VDDA under BOR Event Action</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No Action</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSINT</name>
                  <description>System control interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NMI</name>
                  <description>NMI</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RST</name>
                  <description>Reset</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <displayName>SYSCTL_RIS</displayName>
          <description>Raw Interrupt Status</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BORRIS</name>
              <description>Brown-Out Reset Raw Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MOFRIS</name>
              <description>Main Oscillator Failure Raw Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PLLLRIS</name>
              <description>PLL Lock Raw Interrupt Status</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MOSCPUPRIS</name>
              <description>MOSC Power Up Raw Interrupt Status</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IMC</name>
          <displayName>SYSCTL_IMC</displayName>
          <description>Interrupt Mask Control</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BORIM</name>
              <description>Brown-Out Reset Interrupt Mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MOFIM</name>
              <description>Main Oscillator Failure Interrupt Mask</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PLLLIM</name>
              <description>PLL Lock Interrupt Mask</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MOSCPUPIM</name>
              <description>MOSC Power Up Interrupt Mask</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC</name>
          <displayName>SYSCTL_MISC</displayName>
          <description>Masked Interrupt Status and Clear</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BORMIS</name>
              <description>BOR Masked Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MOFMIS</name>
              <description>Main Oscillator Failure Masked Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PLLLMIS</name>
              <description>PLL Lock Masked Interrupt Status</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MOSCPUPMIS</name>
              <description>MOSC Power Up Masked Interrupt Status</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RESC</name>
          <displayName>SYSCTL_RESC</displayName>
          <description>Reset Cause</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EXT</name>
              <description>External Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>POR</name>
              <description>Power-On Reset</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BOR</name>
              <description>Brown-Out Reset</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WDT0</name>
              <description>Watchdog Timer 0 Reset</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SW</name>
              <description>Software Reset</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WDT1</name>
              <description>Watchdog Timer 1 Reset</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HSSR</name>
              <description>HSSR Reset</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MOSCFAIL</name>
              <description>MOSC Failure Reset</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
