m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>DIVSCLK</name>
          <displayName>SYSCTL_DIVSCLK</displayName>
          <description>Divisor and Source Clock Configuration</description>
          <addressOffset>0x00000148</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DIV</name>
              <description>Divisor Value</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SRC</name>
              <description>Clock Source</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCLK</name>
                  <description>System Clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIOSC</name>
                  <description>PIOSC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOSC</name>
                  <description>MOSC</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN</name>
              <description>DIVSCLK Enable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSPROP</name>
          <displayName>SYSCTL_SYSPROP</displayName>
          <description>System Properties</description>
          <addressOffset>0x0000014C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FPU</name>
              <description>FPU Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PIOSCCAL</name>
          <displayName>SYSCTL_PIOSCCAL</displayName>
          <description>Precision Internal Oscillator Calibration</description>
          <addressOffset>0x00000150</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UT</name>
              <description>User Trim Value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UPDATE</name>
              <description>Update Trim</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CAL</name>
              <description>Start Calibration</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UTEN</name>
              <description>Use User Trim Value</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PIOSCSTAT</name>
          <displayName>SYSCTL_PIOSCSTAT</displayName>
          <description>Precision Internal Oscillator Statistics</description>
          <addressOffset>0x00000154</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CT</name>
              <description>Calibration Trim Value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CR</name>
              <description>Calibration Result</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRNONE</name>
                  <description>Calibration has not been attempted</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRPASS</name>
                  <description>The last calibration operation completed to meet 1% accuracy</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRFAIL</name>
                  <description>The last calibration operation failed to meet 1% accuracy</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DT</name>
              <description>Default Trim Value</description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLFREQ0</name>
          <displayName>SYSCTL_PLLFREQ0</displayName>
          <description>PLL Frequency 0</description>
          <addressOffset>0x00000160</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MINT</name>
              <description>PLL M Integer Value</description>
              <lsb>0</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MFRAC</name>
              <description>PLL M Fractional Value</description>
              <lsb>10</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PLLPWR</name>
              <description>PLL Power</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLFREQ1</name>
          <displayName>SYSCTL_PLLFREQ1</displayName>
          <description>PLL Frequency 1</description>
          <addressOffset>0x00000164</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>N</name>
              <description>PLL N Value</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>Q</name>
              <description>PLL Q Value</description>
              <lsb>8</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLSTAT</name>
          <displayName>SYSCTL_PLLSTAT</displayName>
          <description>PLL Status</description>
          <addressOffset>0x00000168</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LOCK</name>
              <description>PLL Lock</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SLPPWRCFG</name>
          <displayName>SYSCTL_SLPPWRCFG</displayName>
          <description>Sleep Power Configuration</description>
          <addressOffset>0x00000188</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SRAMPM</name>
              <description>SRAM Power Modes</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NRM</name>
                  <description>Active Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SBY</name>
                  <description>Standby Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP</name>
                  <description>Low Power Mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASHPM</name>
              <description>Flash Power Modes</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NRM</name>
                  <description>Active Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLP</name>
                  <description>Low Power Mode</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DSLPPWRCFG</name>
          <displayName>SYSCTL_DSLPPWRCFG</displayName>
          <description>Deep-Sleep Power Configuration</description>
          <addressOffset>0x0000018C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SRAMPM</name>
              <description>SRAM Power Modes</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NRM</name>
                  <description>Active Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SBY</name>
                  <description>Standby Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP</name>
                  <description>Low Power Mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASHPM</name>
              <description>Flash Power Modes</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NRM</name>
                  <description>Active Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLP</name>
                  <description>Low Power Mode</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSPD</name>
              <description>Temperature Sense Power Down</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>LDOSM</name>
              <description>LDO Sleep Mode</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMSTAT</name>
          <displayName>SYSCTL_NVMSTAT</displayName>
          <description>Non-Volatile Memory Information</description>
          <addressOffset>0x000001A0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FWB</name>
              <description>32 Word Flash Write Buffer Available</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>LDOSPCTL</name>
          <displayName>SYSCTL_LDOSPCTL</displayName>
          <description>LDO Sleep Power Control</description>
          <addressOffset>0x000001B4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VLDO</name>
              <description>LDO Output Voltage</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_0_90V</name>
                  <description>0.90 V</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_0_95V</name>
                  <description>0.95 V</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_00V</name>
                  <description>1.00 V</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_05V</name>
                  <description>1.05 V</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_10V</name>
                  <description>1.10 V</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_15V</name>
                  <description>1.15 V</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_20V</name>
                  <description>1.20 V</description>
                  <value>0x18</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADJEN</name>
              <description>Voltage Adjust Enable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>LDODPCTL</name>
          <displayName>SYSCTL_LDODPCTL</displayName>
          <description>LDO Deep-Sleep Power Control</description>
          <addressOffset>0x000001BC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VLDO</name>
              <description>LDO Output Voltage</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_0_90V</name>
                  <description>0.90 V</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_0_95V</name>
                  <description>0.95 V</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_00V</name>
                  <description>1.00 V</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_05V</name>
                  <description>1.05 V</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_10V</name>
                  <description>1.10 V</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_15V</name>
                  <description>1.15 V</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_20V</name>
                  <description>1.20 V</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_25V</name>
                  <description>1.25 V</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_30V</name>
                  <description>1.30 V</description>
                  <value>0x1a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_35V</name>
                  <description>1.35 V</description>
                  <value>0x1b</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADJEN</name>
              <description>Voltage Adjust Enable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
