m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>RESBEHAVCTL</name>
          <displayName>SYSCTL_RESBEHAVCTL</displayName>
          <description>Reset Behavior Control Register</description>
          <addressOffset>0x000001D8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EXTRES</name>
              <description>External RST Pin Operation</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSRST</name>
                  <description>External RST assertion issues a system reset. The application starts within 10 us</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR</name>
                  <description>External RST assertion issues a simulated POR sequence. Application starts less than 500 us after deassertion (Default)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOR</name>
              <description>BOR Reset operation</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSRST</name>
                  <description>Brown Out Reset issues system reset. The application starts within 10 us</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR</name>
                  <description>Brown Out Reset issues a simulated POR sequence. The application starts less than 500 us after deassertion (Default)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDOG0</name>
              <description>Watchdog 0 Reset Operation</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSRST</name>
                  <description>Watchdog 0 issues a system reset. The application starts within 10 us</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR</name>
                  <description>Watchdog 0 issues a simulated POR sequence. Application starts less than 500 us after deassertion (Default)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDOG1</name>
              <description>Watchdog 1 Reset Operation</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSRST</name>
                  <description>Watchdog 1 issues a system reset. The application starts within 10 us</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR</name>
                  <description>Watchdog 1 issues a simulated POR sequence. Application starts less than 500 us after deassertion (Default)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HSSR</name>
          <displayName>SYSCTL_HSSR</displayName>
          <description>Hardware System Service Request</description>
          <addressOffset>0x000001F4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CDOFF</name>
              <description>Command Descriptor Pointer</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16777215</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>KEY</name>
              <description>Write Key</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>USBPDS</name>
          <displayName>SYSCTL_USBPDS</displayName>
          <description>USB Power Domain Status</description>
          <addressOffset>0x00000280</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWRSTAT</name>
              <description>Power Domain Status</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>OFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>ON</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEMSTAT</name>
              <description>Memory Array Power Status</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Array OFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETAIN</name>
                  <description>SRAM Retention</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Array On</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USBMPC</name>
          <displayName>SYSCTL_USBMPC</displayName>
          <description>USB Memory Power Control</description>
          <addressOffset>0x00000284</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWRCTL</name>
              <description>Memory Array Power Control</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Array OFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETAIN</name>
                  <description>SRAM Retention</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Array On</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EMACPDS</name>
          <displayName>SYSCTL_EMACPDS</displayName>
          <description>Ethernet MAC Power Domain Status</description>
          <addressOffset>0x00000288</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWRSTAT</name>
              <description>Power Domain Status</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>OFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>ON</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEMSTAT</name>
              <description>Memory Array Power Status</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Array OFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Array On</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EMACMPC</name>
          <displayName>SYSCTL_EMACMPC</displayName>
          <description>Ethernet MAC Memory Power Control</description>
          <addressOffset>0x0000028C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWRCTL</name>
              <description>Memory Array Power Control</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Array OFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Array On</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PPWD</name>
          <displayName>SYSCTL_PPWD</displayName>
          <description>Watchdog Timer Peripheral Present</description>
          <addressOffset>0x00000300</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P0</name>
              <description>Watchdog Timer 0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P1</name>
              <description>Watchdog Timer 1 Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PPTIMER</name>
          <displayName>SYSCTL_PPTIMER</displayName>
          <description>16/32-Bit General-Purpose Timer Peripheral Present</description>
          <addressOffset>0x00000304</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P0</name>
              <description>16/32-Bit General-Purpose Timer 0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P1</name>
              <description>16/32-Bit General-Purpose Timer 1 Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P2</name>
              <description>16/32-Bit General-Purpose Timer 2 Present</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P3</name>
              <description>16/32-Bit General-Purpose Timer 3 Present</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P4</name>
              <description>16/32-Bit General-Purpose Timer 4 Present</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P5</name>
              <description>16/32-Bit General-Purpose Timer 5 Present</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P6</name>
              <description>16/32-Bit General-Purpose Timer 6 Present</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P7</name>
              <description>16/32-Bit General-Purpose Timer 7 Present</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PPGPIO</name>
          <displayName>SYSCTL_PPGPIO</displayName>
          <description>General-Purpose Input/Output Peripheral Present</description>
          <addressOffset>0x00000308</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P0</name>
              <description>GPIO Port A Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P1</name>
              <description>GPIO Port B Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P2</name>
              <description>GPIO Port C Present</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P3</name>
              <description>GPIO Port D Present</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P4</name>
              <description>GPIO Port E Present</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P5</name>
              <description>GPIO Port F Present</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P6</name>
              <description>GPIO Port G Present</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P7</name>
              <description>GPIO Port H Present</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P8</name>
              <description>GPIO Port J Present</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P9</name>
              <description>GPIO Port K Present</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P10</name>
              <description>GPIO Port L Present</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P11</name>
              <description>GPIO Port M Present</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P12</name>
              <description>GPIO Port N Present</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P13</name>
              <description>GPIO Port P Present</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P14</name>
              <description>GPIO Port Q Present</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
