m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>SRI2C</name>
          <displayName>SYSCTL_SRI2C</displayName>
          <description>Inter-Integrated Circuit Software Reset</description>
          <addressOffset>0x00000520</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>I2C Module 0 Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R1</name>
              <description>I2C Module 1 Software Reset</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R2</name>
              <description>I2C Module 2 Software Reset</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R3</name>
              <description>I2C Module 3 Software Reset</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R4</name>
              <description>I2C Module 4 Software Reset</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R5</name>
              <description>I2C Module 5 Software Reset</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R6</name>
              <description>I2C Module 6 Software Reset</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R7</name>
              <description>I2C Module 7 Software Reset</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R8</name>
              <description>I2C Module 8 Software Reset</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R9</name>
              <description>I2C Module 9 Software Reset</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SRUSB</name>
          <displayName>SYSCTL_SRUSB</displayName>
          <description>Universal Serial Bus Software Reset</description>
          <addressOffset>0x00000528</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>USB Module Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SREPHY</name>
          <displayName>SYSCTL_SREPHY</displayName>
          <description>Ethernet PHY Software Reset</description>
          <addressOffset>0x00000530</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>Ethernet PHY Module Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCAN</name>
          <displayName>SYSCTL_SRCAN</displayName>
          <description>Controller Area Network Software Reset</description>
          <addressOffset>0x00000534</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>CAN Module 0 Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R1</name>
              <description>CAN Module 1 Software Reset</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SRADC</name>
          <displayName>SYSCTL_SRADC</displayName>
          <description>Analog-to-Digital Converter Software Reset</description>
          <addressOffset>0x00000538</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>ADC Module 0 Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R1</name>
              <description>ADC Module 1 Software Reset</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SRACMP</name>
          <displayName>SYSCTL_SRACMP</displayName>
          <description>Analog Comparator Software Reset</description>
          <addressOffset>0x0000053C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>Analog Comparator Module 0 Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SRPWM</name>
          <displayName>SYSCTL_SRPWM</displayName>
          <description>Pulse Width Modulator Software Reset</description>
          <addressOffset>0x00000540</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>PWM Module 0 Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SRQEI</name>
          <displayName>SYSCTL_SRQEI</displayName>
          <description>Quadrature Encoder Interface Software Reset</description>
          <addressOffset>0x00000544</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>QEI Module 0 Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SREEPROM</name>
          <displayName>SYSCTL_SREEPROM</displayName>
          <description>EEPROM Software Reset</description>
          <addressOffset>0x00000558</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>EEPROM Module Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCCM</name>
          <displayName>SYSCTL_SRCCM</displayName>
          <description>CRC and Cryptographic Modules Software Reset</description>
          <addressOffset>0x00000574</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>CRC and Cryptographic Modules Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SREMAC</name>
          <displayName>SYSCTL_SREMAC</displayName>
          <description>Ethernet MAC Software Reset</description>
          <addressOffset>0x0000059C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>Ethernet Controller MAC Module 0 Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCWD</name>
          <displayName>SYSCTL_RCGCWD</displayName>
          <description>Watchdog Timer Run Mode Clock Gating Control</description>
          <addressOffset>0x00000600</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>Watchdog Timer 0 Run Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R1</name>
              <description>Watchdog Timer 1 Run Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCTIMER</name>
          <displayName>SYSCTL_RCGCTIMER</displayName>
          <description>16/32-Bit General-Purpose Timer Run Mode Clock Gating Control</description>
          <addressOffset>0x00000604</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>16/32-Bit General-Purpose Timer 0 Run Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R1</name>
              <description>16/32-Bit General-Purpose Timer 1 Run Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R2</name>
              <description>16/32-Bit General-Purpose Timer 2 Run Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R3</name>
              <description>16/32-Bit General-Purpose Timer 3 Run Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R4</name>
              <description>16/32-Bit General-Purpose Timer 4 Run Mode Clock Gating Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R5</name>
              <description>16/32-Bit General-Purpose Timer 5 Run Mode Clock Gating Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R6</name>
              <description>16/32-Bit General-Purpose Timer 6 Run Mode Clock Gating Control</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R7</name>
              <description>16/32-Bit General-Purpose Timer 7 Run Mode Clock Gating Control</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
