m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>RCGCADC</name>
          <displayName>SYSCTL_RCGCADC</displayName>
          <description>Analog-to-Digital Converter Run Mode Clock Gating Control</description>
          <addressOffset>0x00000638</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>ADC Module 0 Run Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R1</name>
              <description>ADC Module 1 Run Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCACMP</name>
          <displayName>SYSCTL_RCGCACMP</displayName>
          <description>Analog Comparator Run Mode Clock Gating Control</description>
          <addressOffset>0x0000063C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>Analog Comparator Module 0 Run Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCPWM</name>
          <displayName>SYSCTL_RCGCPWM</displayName>
          <description>Pulse Width Modulator Run Mode Clock Gating Control</description>
          <addressOffset>0x00000640</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>PWM Module 0 Run Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCQEI</name>
          <displayName>SYSCTL_RCGCQEI</displayName>
          <description>Quadrature Encoder Interface Run Mode Clock Gating Control</description>
          <addressOffset>0x00000644</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>QEI Module 0 Run Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCEEPROM</name>
          <displayName>SYSCTL_RCGCEEPROM</displayName>
          <description>EEPROM Run Mode Clock Gating Control</description>
          <addressOffset>0x00000658</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>EEPROM Module Run Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCCCM</name>
          <displayName>SYSCTL_RCGCCCM</displayName>
          <description>CRC and Cryptographic Modules Run Mode Clock Gating Control</description>
          <addressOffset>0x00000674</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>CRC and Cryptographic Modules Run Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCEMAC</name>
          <displayName>SYSCTL_RCGCEMAC</displayName>
          <description>Ethernet MAC Run Mode Clock Gating Control</description>
          <addressOffset>0x0000069C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>Ethernet MAC Module 0 Run Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCWD</name>
          <displayName>SYSCTL_SCGCWD</displayName>
          <description>Watchdog Timer Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000700</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>Watchdog Timer 0 Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S1</name>
              <description>Watchdog Timer 1 Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCTIMER</name>
          <displayName>SYSCTL_SCGCTIMER</displayName>
          <description>16/32-Bit General-Purpose Timer Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000704</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>16/32-Bit General-Purpose Timer 0 Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S1</name>
              <description>16/32-Bit General-Purpose Timer 1 Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S2</name>
              <description>16/32-Bit General-Purpose Timer 2 Sleep Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S3</name>
              <description>16/32-Bit General-Purpose Timer 3 Sleep Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S4</name>
              <description>16/32-Bit General-Purpose Timer 4 Sleep Mode Clock Gating Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S5</name>
              <description>16/32-Bit General-Purpose Timer 5 Sleep Mode Clock Gating Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S6</name>
              <description>16/32-Bit General-Purpose Timer 6 Sleep Mode Clock Gating Control</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S7</name>
              <description>16/32-Bit General-Purpose Timer 7 Sleep Mode Clock Gating Control</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCGPIO</name>
          <displayName>SYSCTL_SCGCGPIO</displayName>
          <description>General-Purpose Input/Output Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000708</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>GPIO Port A Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S1</name>
              <description>GPIO Port B Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S2</name>
              <description>GPIO Port C Sleep Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S3</name>
              <description>GPIO Port D Sleep Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S4</name>
              <description>GPIO Port E Sleep Mode Clock Gating Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S5</name>
              <description>GPIO Port F Sleep Mode Clock Gating Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S6</name>
              <description>GPIO Port G Sleep Mode Clock Gating Control</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S7</name>
              <description>GPIO Port H Sleep Mode Clock Gating Control</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S8</name>
              <description>GPIO Port J Sleep Mode Clock Gating Control</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S9</name>
              <description>GPIO Port K Sleep Mode Clock Gating Control</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S10</name>
              <description>GPIO Port L Sleep Mode Clock Gating Control</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S11</name>
              <description>GPIO Port M Sleep Mode Clock Gating Control</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S12</name>
              <description>GPIO Port N Sleep Mode Clock Gating Control</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S13</name>
              <description>GPIO Port P Sleep Mode Clock Gating Control</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S14</name>
              <description>GPIO Port Q Sleep Mode Clock Gating Control</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCDMA</name>
          <displayName>SYSCTL_SCGCDMA</displayName>
          <description>Micro Direct Memory Access Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000070C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>uDMA Module Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCEPI</name>
          <displayName>SYSCTL_SCGCEPI</displayName>
          <description>EPI Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000710</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>EPI Module Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCHIB</name>
          <displayName>SYSCTL_SCGCHIB</displayName>
          <description>Hibernation Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000714</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>Hibernation Module Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
