m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>DCGCI2C</name>
          <displayName>SYSCTL_DCGCI2C</displayName>
          <description>Inter-Integrated Circuit Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000820</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>I2C Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D1</name>
              <description>I2C Module 1 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D2</name>
              <description>I2C Module 2 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D3</name>
              <description>I2C Module 3 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D4</name>
              <description>I2C Module 4 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D5</name>
              <description>I2C Module 5 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D6</name>
              <description>I2C Module 6 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D7</name>
              <description>I2C Module 7 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D8</name>
              <description>I2C Module 8 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D9</name>
              <description>I2C Module 9 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCUSB</name>
          <displayName>SYSCTL_DCGCUSB</displayName>
          <description>Universal Serial Bus Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000828</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>USB Module Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCEPHY</name>
          <displayName>SYSCTL_DCGCEPHY</displayName>
          <description>Ethernet PHY Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000830</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>PHY Module Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCCAN</name>
          <displayName>SYSCTL_DCGCCAN</displayName>
          <description>Controller Area Network Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000834</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>CAN Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D1</name>
              <description>CAN Module 1 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCADC</name>
          <displayName>SYSCTL_DCGCADC</displayName>
          <description>Analog-to-Digital Converter Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000838</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>ADC Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D1</name>
              <description>ADC Module 1 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCACMP</name>
          <displayName>SYSCTL_DCGCACMP</displayName>
          <description>Analog Comparator Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000083C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>Analog Comparator Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCPWM</name>
          <displayName>SYSCTL_DCGCPWM</displayName>
          <description>Pulse Width Modulator Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000840</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>PWM Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCQEI</name>
          <displayName>SYSCTL_DCGCQEI</displayName>
          <description>Quadrature Encoder Interface Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000844</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>QEI Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCEEPROM</name>
          <displayName>SYSCTL_DCGCEEPROM</displayName>
          <description>EEPROM Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000858</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>EEPROM Module Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCCCM</name>
          <displayName>SYSCTL_DCGCCCM</displayName>
          <description>CRC and Cryptographic Modules Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000874</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>CRC and Cryptographic Modules Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCEMAC</name>
          <displayName>SYSCTL_DCGCEMAC</displayName>
          <description>Ethernet MAC Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000089C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>Ethernet MAC Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PCWD</name>
          <displayName>SYSCTL_PCWD</displayName>
          <description>Watchdog Timer Power Control</description>
          <addressOffset>0x00000900</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P0</name>
              <description>Watchdog Timer 0 Power Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P1</name>
              <description>Watchdog Timer 1 Power Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PCTIMER</name>
          <displayName>SYSCTL_PCTIMER</displayName>
          <description>16/32-Bit General-Purpose Timer Power Control</description>
          <addressOffset>0x00000904</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P0</name>
              <description>General-Purpose Timer 0 Power Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P1</name>
              <description>General-Purpose Timer 1 Power Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P2</name>
              <description>General-Purpose Timer 2 Power Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P3</name>
              <description>General-Purpose Timer 3 Power Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P4</name>
              <description>General-Purpose Timer 4 Power Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P5</name>
              <description>General-Purpose Timer 5 Power Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P6</name>
              <description>General-Purpose Timer 6 Power Control</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P7</name>
              <description>General-Purpose Timer 7 Power Control</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
