m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>CHMAP1</name>
          <displayName>UDMA_CHMAP1</displayName>
          <description>DMA Channel Map Select 1</description>
          <addressOffset>0x00000514</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH8SEL</name>
              <description>uDMA Channel 8 Source Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CH9SEL</name>
              <description>uDMA Channel 9 Source Select</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CH10SEL</name>
              <description>uDMA Channel 10 Source Select</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CH11SEL</name>
              <description>uDMA Channel 11 Source Select</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CH12SEL</name>
              <description>uDMA Channel 12 Source Select</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CH13SEL</name>
              <description>uDMA Channel 13 Source Select</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CH14SEL</name>
              <description>uDMA Channel 14 Source Select</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CH15SEL</name>
              <description>uDMA Channel 15 Source Select</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CHMAP2</name>
          <displayName>UDMA_CHMAP2</displayName>
          <description>DMA Channel Map Select 2</description>
          <addressOffset>0x00000518</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH16SEL</name>
              <description>uDMA Channel 16 Source Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CH17SEL</name>
              <description>uDMA Channel 17 Source Select</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CH18SEL</name>
              <description>uDMA Channel 18 Source Select</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CH19SEL</name>
              <description>uDMA Channel 19 Source Select</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CH20SEL</name>
              <description>uDMA Channel 20 Source Select</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CH21SEL</name>
              <description>uDMA Channel 21 Source Select</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CH22SEL</name>
              <description>uDMA Channel 22 Source Select</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CH23SEL</name>
              <description>uDMA Channel 23 Source Select</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CHMAP3</name>
          <displayName>UDMA_CHMAP3</displayName>
          <description>DMA Channel Map Select 3</description>
          <addressOffset>0x0000051C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH24SEL</name>
              <description>uDMA Channel 24 Source Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CH25SEL</name>
              <description>uDMA Channel 25 Source Select</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CH26SEL</name>
              <description>uDMA Channel 26 Source Select</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CH27SEL</name>
              <description>uDMA Channel 27 Source Select</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CH28SEL</name>
              <description>uDMA Channel 28 Source Select</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CH29SEL</name>
              <description>uDMA Channel 29 Source Select</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CH30SEL</name>
              <description>uDMA Channel 30 Source Select</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CH31SEL</name>
              <description>uDMA Channel 31 Source Select</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
