m-labs/dslite2svd/svd/tm4c129x.xml
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/nvic.xml -->
    <peripheral>
      <name>NVIC</name>
      <description>NVIC register addresses</description>
      <baseAddress>0xE000E000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>ACTLR</name>
          <displayName>NVIC_ACTLR</displayName>
          <description>Auxiliary Control</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DISMCYC</name>
              <description>Disable Interrupts of Multiple Cycle Instructions</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DISWBUF</name>
              <description>Disable Write Buffer</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DISFOLD</name>
              <description>Disable IT Folding</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DISFPCA</name>
              <description>Disable CONTROL</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DISOOFP</name>
              <description>Disable Out-Of-Order Floating Point</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ST_CTRL</name>
          <displayName>NVIC_ST_CTRL</displayName>
          <description>SysTick Control and Status Register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTEN</name>
              <description>Interrupt Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CLK_SRC</name>
              <description>Clock Source</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>COUNT</name>
              <description>Count Flag</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ST_RELOAD</name>
          <displayName>NVIC_ST_RELOAD</displayName>
          <description>SysTick Reload Value Register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_ST_RELOAD</name>
              <description>Reload Value</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16777215</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ST_CURRENT</name>
          <displayName>NVIC_ST_CURRENT</displayName>
          <description>SysTick Current Value Register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_ST_CURRENT</name>
              <description>Current Value</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16777215</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EN0</name>
          <displayName>NVIC_EN0</displayName>
          <description>Interrupt 0-31 Set Enable</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT</name>
              <description>Interrupt Enable</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EN1</name>
          <displayName>NVIC_EN1</displayName>
          <description>Interrupt 32-63 Set Enable</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT</name>
              <description>Interrupt Enable</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EN2</name>
          <displayName>NVIC_EN2</displayName>
          <description>Interrupt 64-95 Set Enable</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT</name>
              <description>Interrupt Enable</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EN3</name>
          <displayName>NVIC_EN3</displayName>
          <description>Interrupt 96-127 Set Enable</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT</name>
              <description>Interrupt Enable</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DIS0</name>
          <displayName>NVIC_DIS0</displayName>
          <description>Interrupt 0-31 Clear Enable</description>
          <addressOffset>0x00000180</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT</name>
              <description>Interrupt Disable</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DIS1</name>
          <displayName>NVIC_DIS1</displayName>
          <description>Interrupt 32-63 Clear Enable</description>
          <addressOffset>0x00000184</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT</name>
              <description>Interrupt Disable</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DIS2</name>
          <displayName>NVIC_DIS2</displayName>
          <description>Interrupt 64-95 Clear Enable</description>
          <addressOffset>0x00000188</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT</name>
              <description>Interrupt Disable</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DIS3</name>
          <displayName>NVIC_DIS3</displayName>
          <description>Interrupt 96-127 Clear Enable</description>
          <addressOffset>0x0000018C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT</name>
              <description>Interrupt Disable</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PEND0</name>
          <displayName>NVIC_PEND0</displayName>
          <description>Interrupt 0-31 Set Pending</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT</name>
              <description>Interrupt Set Pending</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PEND1</name>
          <displayName>NVIC_PEND1</displayName>
          <description>Interrupt 32-63 Set Pending</description>
          <addressOffset>0x00000204</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT</name>
              <description>Interrupt Set Pending</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PEND2</name>
          <displayName>NVIC_PEND2</displayName>
          <description>Interrupt 64-95 Set Pending</description>
          <addressOffset>0x00000208</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT</name>
              <description>Interrupt Set Pending</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PEND3</name>
          <displayName>NVIC_PEND3</displayName>
          <description>Interrupt 96-127 Set Pending</description>
          <addressOffset>0x0000020C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT</name>
              <description>Interrupt Set Pending</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>UNPEND0</name>
          <displayName>NVIC_UNPEND0</displayName>
          <description>Interrupt 0-31 Clear Pending</description>
          <addressOffset>0x00000280</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT</name>
              <description>Interrupt Clear Pending</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>UNPEND1</name>
          <displayName>NVIC_UNPEND1</displayName>
          <description>Interrupt 32-63 Clear Pending</description>
          <addressOffset>0x00000284</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT</name>
              <description>Interrupt Clear Pending</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>UNPEND2</name>
          <displayName>NVIC_UNPEND2</displayName>
          <description>Interrupt 64-95 Clear Pending</description>
          <addressOffset>0x00000288</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT</name>
              <description>Interrupt Clear Pending</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>UNPEND3</name>
          <displayName>NVIC_UNPEND3</displayName>
          <description>Interrupt 96-127 Clear Pending</description>
          <addressOffset>0x0000028C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT</name>
              <description>Interrupt Clear Pending</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ACTIVE0</name>
          <displayName>NVIC_ACTIVE0</displayName>
          <description>Interrupt 0-31 Active Bit</description>
          <addressOffset>0x00000300</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT</name>
              <description>Interrupt Active</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ACTIVE1</name>
          <displayName>NVIC_ACTIVE1</displayName>
          <description>Interrupt 32-63 Active Bit</description>
          <addressOffset>0x00000304</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT</name>
              <description>Interrupt Active</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ACTIVE2</name>
          <displayName>NVIC_ACTIVE2</displayName>
          <description>Interrupt 64-95 Active Bit</description>
          <addressOffset>0x00000308</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT</name>
              <description>Interrupt Active</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ACTIVE3</name>
          <displayName>NVIC_ACTIVE3</displayName>
          <description>Interrupt 96-127 Active Bit</description>
          <addressOffset>0x0000030C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT</name>
              <description>Interrupt Active</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI0</name>
          <displayName>NVIC_PRI0</displayName>
          <description>Interrupt 0-3 Priority</description>
          <addressOffset>0x00000400</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT0</name>
              <description>Interrupt 0 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT1</name>
              <description>Interrupt 1 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT2</name>
              <description>Interrupt 2 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT3</name>
              <description>Interrupt 3 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
