m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>PRI1</name>
          <displayName>NVIC_PRI1</displayName>
          <description>Interrupt 4-7 Priority</description>
          <addressOffset>0x00000404</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT4</name>
              <description>Interrupt 4 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT5</name>
              <description>Interrupt 5 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT6</name>
              <description>Interrupt 6 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT7</name>
              <description>Interrupt 7 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI2</name>
          <displayName>NVIC_PRI2</displayName>
          <description>Interrupt 8-11 Priority</description>
          <addressOffset>0x00000408</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT8</name>
              <description>Interrupt 8 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT9</name>
              <description>Interrupt 9 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT10</name>
              <description>Interrupt 10 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT11</name>
              <description>Interrupt 11 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI3</name>
          <displayName>NVIC_PRI3</displayName>
          <description>Interrupt 12-15 Priority</description>
          <addressOffset>0x0000040C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT12</name>
              <description>Interrupt 12 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT13</name>
              <description>Interrupt 13 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT14</name>
              <description>Interrupt 14 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT15</name>
              <description>Interrupt 15 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI4</name>
          <displayName>NVIC_PRI4</displayName>
          <description>Interrupt 16-19 Priority</description>
          <addressOffset>0x00000410</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT16</name>
              <description>Interrupt 16 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT17</name>
              <description>Interrupt 17 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT18</name>
              <description>Interrupt 18 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT19</name>
              <description>Interrupt 19 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI5</name>
          <displayName>NVIC_PRI5</displayName>
          <description>Interrupt 20-23 Priority</description>
          <addressOffset>0x00000414</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT20</name>
              <description>Interrupt 20 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT21</name>
              <description>Interrupt 21 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT22</name>
              <description>Interrupt 22 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT23</name>
              <description>Interrupt 23 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI6</name>
          <displayName>NVIC_PRI6</displayName>
          <description>Interrupt 24-27 Priority</description>
          <addressOffset>0x00000418</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT24</name>
              <description>Interrupt 24 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT25</name>
              <description>Interrupt 25 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT26</name>
              <description>Interrupt 26 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT27</name>
              <description>Interrupt 27 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI7</name>
          <displayName>NVIC_PRI7</displayName>
          <description>Interrupt 28-31 Priority</description>
          <addressOffset>0x0000041C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT28</name>
              <description>Interrupt 28 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT29</name>
              <description>Interrupt 29 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT30</name>
              <description>Interrupt 30 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT31</name>
              <description>Interrupt 31 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI8</name>
          <displayName>NVIC_PRI8</displayName>
          <description>Interrupt 32-35 Priority</description>
          <addressOffset>0x00000420</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT32</name>
              <description>Interrupt 32 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT33</name>
              <description>Interrupt 33 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT34</name>
              <description>Interrupt 34 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT35</name>
              <description>Interrupt 35 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI9</name>
          <displayName>NVIC_PRI9</displayName>
          <description>Interrupt 36-39 Priority</description>
          <addressOffset>0x00000424</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT36</name>
              <description>Interrupt 36 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT37</name>
              <description>Interrupt 37 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT38</name>
              <description>Interrupt 38 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT39</name>
              <description>Interrupt 39 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI10</name>
          <displayName>NVIC_PRI10</displayName>
          <description>Interrupt 40-43 Priority</description>
          <addressOffset>0x00000428</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT40</name>
              <description>Interrupt 40 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT41</name>
              <description>Interrupt 41 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT42</name>
              <description>Interrupt 42 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT43</name>
              <description>Interrupt 43 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI11</name>
          <displayName>NVIC_PRI11</displayName>
          <description>Interrupt 44-47 Priority</description>
          <addressOffset>0x0000042C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT44</name>
              <description>Interrupt 44 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT45</name>
              <description>Interrupt 45 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT46</name>
              <description>Interrupt 46 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT47</name>
              <description>Interrupt 47 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
