m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>PRI12</name>
          <displayName>NVIC_PRI12</displayName>
          <description>Interrupt 48-51 Priority</description>
          <addressOffset>0x00000430</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT48</name>
              <description>Interrupt 48 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT49</name>
              <description>Interrupt 49 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT50</name>
              <description>Interrupt 50 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT51</name>
              <description>Interrupt 51 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI13</name>
          <displayName>NVIC_PRI13</displayName>
          <description>Interrupt 52-55 Priority</description>
          <addressOffset>0x00000434</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT52</name>
              <description>Interrupt 52 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT53</name>
              <description>Interrupt 53 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT54</name>
              <description>Interrupt 54 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT55</name>
              <description>Interrupt 55 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI14</name>
          <displayName>NVIC_PRI14</displayName>
          <description>Interrupt 56-59 Priority</description>
          <addressOffset>0x00000438</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTA</name>
              <description>Interrupt 56 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTB</name>
              <description>Interrupt 57 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTC</name>
              <description>Interrupt 58 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTD</name>
              <description>Interrupt 59 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI15</name>
          <displayName>NVIC_PRI15</displayName>
          <description>Interrupt 60-63 Priority</description>
          <addressOffset>0x0000043C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTA</name>
              <description>Interrupt 60 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTB</name>
              <description>Interrupt 61 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTC</name>
              <description>Interrupt 62 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTD</name>
              <description>Interrupt 63 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI16</name>
          <displayName>NVIC_PRI16</displayName>
          <description>Interrupt 64-67 Priority</description>
          <addressOffset>0x00000440</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTA</name>
              <description>Interrupt 64 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTB</name>
              <description>Interrupt 65 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTC</name>
              <description>Interrupt 66 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTD</name>
              <description>Interrupt 67 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI17</name>
          <displayName>NVIC_PRI17</displayName>
          <description>Interrupt 68-71 Priority</description>
          <addressOffset>0x00000444</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTA</name>
              <description>Interrupt 68 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTB</name>
              <description>Interrupt 69 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTC</name>
              <description>Interrupt 70 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTD</name>
              <description>Interrupt 71 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI18</name>
          <displayName>NVIC_PRI18</displayName>
          <description>Interrupt 72-75 Priority</description>
          <addressOffset>0x00000448</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTA</name>
              <description>Interrupt 72 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTB</name>
              <description>Interrupt 73 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTC</name>
              <description>Interrupt 74 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTD</name>
              <description>Interrupt 75 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI19</name>
          <displayName>NVIC_PRI19</displayName>
          <description>Interrupt 76-79 Priority</description>
          <addressOffset>0x0000044C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTA</name>
              <description>Interrupt 76 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTB</name>
              <description>Interrupt 77 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTC</name>
              <description>Interrupt 78 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTD</name>
              <description>Interrupt 79 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI20</name>
          <displayName>NVIC_PRI20</displayName>
          <description>Interrupt 80-83 Priority</description>
          <addressOffset>0x00000450</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTA</name>
              <description>Interrupt 80 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTB</name>
              <description>Interrupt 81 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTC</name>
              <description>Interrupt 82 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTD</name>
              <description>Interrupt 83 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI21</name>
          <displayName>NVIC_PRI21</displayName>
          <description>Interrupt 84-87 Priority</description>
          <addressOffset>0x00000454</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTA</name>
              <description>Interrupt 84 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTB</name>
              <description>Interrupt 85 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTC</name>
              <description>Interrupt 86 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTD</name>
              <description>Interrupt 87 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI22</name>
          <displayName>NVIC_PRI22</displayName>
          <description>Interrupt 88-91 Priority</description>
          <addressOffset>0x00000458</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTA</name>
              <description>Interrupt 88 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTB</name>
              <description>Interrupt 89 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTC</name>
              <description>Interrupt 90 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTD</name>
              <description>Interrupt 91 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
