m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>PRI23</name>
          <displayName>NVIC_PRI23</displayName>
          <description>Interrupt 92-95 Priority</description>
          <addressOffset>0x0000045C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTA</name>
              <description>Interrupt 92 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTB</name>
              <description>Interrupt 93 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTC</name>
              <description>Interrupt 94 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTD</name>
              <description>Interrupt 95 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI24</name>
          <displayName>NVIC_PRI24</displayName>
          <description>Interrupt 96-99 Priority</description>
          <addressOffset>0x00000460</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTA</name>
              <description>Interrupt 96 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTB</name>
              <description>Interrupt 97 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTC</name>
              <description>Interrupt 98 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTD</name>
              <description>Interrupt 99 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI25</name>
          <displayName>NVIC_PRI25</displayName>
          <description>Interrupt 100-103 Priority</description>
          <addressOffset>0x00000464</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTA</name>
              <description>Interrupt 100 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTB</name>
              <description>Interrupt 101 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTC</name>
              <description>Interrupt 102 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTD</name>
              <description>Interrupt 103 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI26</name>
          <displayName>NVIC_PRI26</displayName>
          <description>Interrupt 104-107 Priority</description>
          <addressOffset>0x00000468</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTA</name>
              <description>Interrupt 104 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTB</name>
              <description>Interrupt 105 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTC</name>
              <description>Interrupt 106 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTD</name>
              <description>Interrupt 107 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI27</name>
          <displayName>NVIC_PRI27</displayName>
          <description>Interrupt 108-111 Priority</description>
          <addressOffset>0x0000046C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTA</name>
              <description>Interrupt 108 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTB</name>
              <description>Interrupt 109 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTC</name>
              <description>Interrupt 110 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTD</name>
              <description>Interrupt 111 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI28</name>
          <displayName>NVIC_PRI28</displayName>
          <description>Interrupt 112-115 Priority</description>
          <addressOffset>0x00000470</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTA</name>
              <description>Interrupt 112 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTB</name>
              <description>Interrupt 113 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTC</name>
              <description>Interrupt 114 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTD</name>
              <description>Interrupt 115 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUID</name>
          <displayName>NVIC_CPUID</displayName>
          <description>CPU ID Base</description>
          <addressOffset>0x00000D00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REV</name>
              <description>Revision Number</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PARTNO</name>
              <description>Part Number</description>
              <lsb>4</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM4</name>
                  <description>Cortex-M4 processor</description>
                  <value>0xc24</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CON</name>
              <description>Constant</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VAR</name>
              <description>Variant Number</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IMP</name>
              <description>Implementer Code</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARM</name>
                  <description>ARM</description>
                  <value>0x41</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CTRL</name>
          <displayName>NVIC_INT_CTRL</displayName>
          <description>Interrupt Control and State</description>
          <addressOffset>0x00000D04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VEC_ACT</name>
              <description>Interrupt Pending Vector Number</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RET_BASE</name>
              <description>Return to Base</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VEC_PEN</name>
              <description>Interrupt Pending Vector Number</description>
              <lsb>12</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NMI</name>
                  <description>NMI</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HARD</name>
                  <description>Hard fault</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEM</name>
                  <description>Memory management fault</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUS</name>
                  <description>Bus fault</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USG</name>
                  <description>Usage fault</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVC</name>
                  <description>SVCall</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PNDSV</name>
                  <description>PendSV</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TICK</name>
                  <description>SysTick</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISR_PEND</name>
              <description>Interrupt Pending</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ISR_PRE</name>
              <description>Debug Interrupt Handling</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PENDSTCLR</name>
              <description>SysTick Clear Pending</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PENDSTSET</name>
              <description>SysTick Set Pending</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UNPEND_SV</name>
              <description>PendSV Clear Pending</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PEND_SV</name>
              <description>PendSV Set Pending</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NMI_SET</name>
              <description>NMI Set Pending</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>VTABLE</name>
          <displayName>NVIC_VTABLE</displayName>
          <description>Vector Table Offset</description>
          <addressOffset>0x00000D08</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Vector Table Offset</description>
              <lsb>10</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4194303</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
