m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>APINT</name>
          <displayName>NVIC_APINT</displayName>
          <description>Application Interrupt and Reset Control</description>
          <addressOffset>0x00000D0C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VECT_RESET</name>
              <description>System Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VECT_CLR_ACT</name>
              <description>Clear Active NMI / Fault</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SYSRESETREQ</name>
              <description>System Reset Request</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PRIGROUP</name>
              <description>Interrupt Priority Grouping</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_7_1</name>
                  <description>Priority group 7.1 split</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_6_2</name>
                  <description>Priority group 6.2 split</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_5_3</name>
                  <description>Priority group 5.3 split</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4_4</name>
                  <description>Priority group 4.4 split</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_3_5</name>
                  <description>Priority group 3.5 split</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2_6</name>
                  <description>Priority group 2.6 split</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_7</name>
                  <description>Priority group 1.7 split</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_0_8</name>
                  <description>Priority group 0.8 split</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENDIANESS</name>
              <description>Data Endianess</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VECTKEY</name>
              <description>Register Key</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_APINT_VECTKEY</name>
                  <description>Vector key</description>
                  <value>0x5fa</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS_CTRL</name>
          <displayName>NVIC_SYS_CTRL</displayName>
          <description>System Control</description>
          <addressOffset>0x00000D10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SLEEPEXIT</name>
              <description>Sleep on ISR Exit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SLEEPDEEP</name>
              <description>Deep Sleep Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SEVONPEND</name>
              <description>Wake Up on Pending</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG_CTRL</name>
          <displayName>NVIC_CFG_CTRL</displayName>
          <description>Configuration and Control</description>
          <addressOffset>0x00000D14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BASE_THR</name>
              <description>Thread State Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MAIN_PEND</name>
              <description>Allow Main Interrupt Trigger</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UNALIGNED</name>
              <description>Trap on Unaligned Access</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DIV0</name>
              <description>Trap on Divide by 0</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BFHFNMIGN</name>
              <description>Ignore Bus Fault in NMI and Fault</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>STKALIGN</name>
              <description>Stack Alignment on Exception Entry</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS_PRI1</name>
          <displayName>NVIC_SYS_PRI1</displayName>
          <description>System Handler Priority 1</description>
          <addressOffset>0x00000D18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MEM</name>
              <description>Memory Management Fault Priority</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BUS</name>
              <description>Bus Fault Priority</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>USAGE</name>
              <description>Usage Fault Priority</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS_PRI2</name>
          <displayName>NVIC_SYS_PRI2</displayName>
          <description>System Handler Priority 2</description>
          <addressOffset>0x00000D1C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SVC</name>
              <description>SVCall Priority</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS_PRI3</name>
          <displayName>NVIC_SYS_PRI3</displayName>
          <description>System Handler Priority 3</description>
          <addressOffset>0x00000D20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DEBUG</name>
              <description>Debug Priority</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PENDSV</name>
              <description>PendSV Priority</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TICK</name>
              <description>SysTick Exception Priority</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS_HND_CTRL</name>
          <displayName>NVIC_SYS_HND_CTRL</displayName>
          <description>System Handler Control and State</description>
          <addressOffset>0x00000D24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MEMA</name>
              <description>Memory Management Fault Active</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BUSA</name>
              <description>Bus Fault Active</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>USGA</name>
              <description>Usage Fault Active</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SVCA</name>
              <description>SVC Call Active</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MON</name>
              <description>Debug Monitor Active</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PNDSV</name>
              <description>PendSV Exception Active</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TICK</name>
              <description>SysTick Exception Active</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>USAGEP</name>
              <description>Usage Fault Pending</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MEMP</name>
              <description>Memory Management Fault Pending</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BUSP</name>
              <description>Bus Fault Pending</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SVC</name>
              <description>SVC Call Pending</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MEM</name>
              <description>Memory Management Fault Enable</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BUS</name>
              <description>Bus Fault Enable</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>USAGE</name>
              <description>Usage Fault Enable</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
