m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>FAULT_STAT</name>
          <displayName>NVIC_FAULT_STAT</displayName>
          <description>Configurable Fault Status</description>
          <addressOffset>0x00000D28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IERR</name>
              <description>Instruction Access Violation</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DERR</name>
              <description>Data Access Violation</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MUSTKE</name>
              <description>Unstack Access Violation</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MSTKE</name>
              <description>Stack Access Violation</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MLSPERR</name>
              <description>Memory Management Fault on Floating-Point Lazy State Preservation</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MMARV</name>
              <description>Memory Management Fault Address Register Valid</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IBUS</name>
              <description>Instruction Bus Error</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PRECISE</name>
              <description>Precise Data Bus Error</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IMPRE</name>
              <description>Imprecise Data Bus Error</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BUSTKE</name>
              <description>Unstack Bus Fault</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BSTKE</name>
              <description>Stack Bus Fault</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BLSPERR</name>
              <description>Bus Fault on Floating-Point Lazy State Preservation</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BFARV</name>
              <description>Bus Fault Address Register Valid</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UNDEF</name>
              <description>Undefined Instruction Usage Fault</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INVSTAT</name>
              <description>Invalid State Usage Fault</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INVPC</name>
              <description>Invalid PC Load Usage Fault</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NOCP</name>
              <description>No Coprocessor Usage Fault</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UNALIGN</name>
              <description>Unaligned Access Usage Fault</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DIV0</name>
              <description>Divide-by-Zero Usage Fault</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HFAULT_STAT</name>
          <displayName>NVIC_HFAULT_STAT</displayName>
          <description>Hard Fault Status</description>
          <addressOffset>0x00000D2C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VECT</name>
              <description>Vector Table Read Fault</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FORCED</name>
              <description>Forced Hard Fault</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DBG</name>
              <description>Debug Event</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUG_STAT</name>
          <displayName>NVIC_DEBUG_STAT</displayName>
          <description>Debug Status Register</description>
          <addressOffset>0x00000D30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HALTED</name>
              <description>Halt request</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BKPT</name>
              <description>Breakpoint instruction</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DWTTRAP</name>
              <description>DWT match</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VCATCH</name>
              <description>Vector catch</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EXTRNL</name>
              <description>EDBGRQ asserted</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MM_ADDR</name>
          <displayName>NVIC_MM_ADDR</displayName>
          <description>Memory Management Fault Address</description>
          <addressOffset>0x00000D34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_MM_ADDR</name>
              <description>Fault Address</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FAULT_ADDR</name>
          <displayName>NVIC_FAULT_ADDR</displayName>
          <description>Bus Fault Address</description>
          <addressOffset>0x00000D38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_FAULT_ADDR</name>
              <description>Fault Address</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAC</name>
          <displayName>NVIC_CPAC</displayName>
          <description>Coprocessor Access Control</description>
          <addressOffset>0x00000D88</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CP10</name>
              <description>CP10 Coprocessor Access Privilege</description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Access Denied</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRIV</name>
                  <description>Privileged Access Only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>Full Access</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP11</name>
              <description>CP11 Coprocessor Access Privilege</description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Access Denied</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRIV</name>
                  <description>Privileged Access Only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>Full Access</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_TYPE</name>
          <displayName>NVIC_MPU_TYPE</displayName>
          <description>MPU Type</description>
          <addressOffset>0x00000D90</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEPARATE</name>
              <description>Separate or Unified MPU</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DREGION</name>
              <description>Number of D Regions</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IREGION</name>
              <description>Number of I Regions</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_CTRL</name>
          <displayName>NVIC_MPU_CTRL</displayName>
          <description>MPU Control</description>
          <addressOffset>0x00000D94</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>MPU Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HFNMIENA</name>
              <description>MPU Enabled During Faults</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PRIVDEFEN</name>
              <description>MPU Default Region</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_NUMBER</name>
          <displayName>NVIC_MPU_NUMBER</displayName>
          <description>MPU Region Number</description>
          <addressOffset>0x00000D98</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_MPU_NUMBER</name>
              <description>MPU Region to Access</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_BASE</name>
          <displayName>NVIC_MPU_BASE</displayName>
          <description>MPU Region Base Address</description>
          <addressOffset>0x00000D9C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REGION</name>
              <description>Region Number</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VALID</name>
              <description>Region Number Valid</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ADDR</name>
              <description>Base Address Mask</description>
              <lsb>5</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>134217727</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
