m-labs/dslite2svd/svd/tm4c129x.xml
        <register>
          <name>DBG_XFER</name>
          <displayName>NVIC_DBG_XFER</displayName>
          <description>Debug Core Reg. Transfer Select</description>
          <addressOffset>0x00000DF4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL</name>
              <description>Register</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>R0</name>
                  <description>Register R0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R1</name>
                  <description>Register R1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R2</name>
                  <description>Register R2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R3</name>
                  <description>Register R3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R4</name>
                  <description>Register R4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R5</name>
                  <description>Register R5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R6</name>
                  <description>Register R6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R7</name>
                  <description>Register R7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R8</name>
                  <description>Register R8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R9</name>
                  <description>Register R9</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R10</name>
                  <description>Register R10</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R11</name>
                  <description>Register R11</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R12</name>
                  <description>Register R12</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R13</name>
                  <description>Register R13</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R14</name>
                  <description>Register R14</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R15</name>
                  <description>Register R15</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAGS</name>
                  <description>xPSR/Flags register</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSP</name>
                  <description>Main SP</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSP</name>
                  <description>Process SP</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP</name>
                  <description>Deep SP</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CFBP</name>
                  <description>Control/Fault/BasePri/PriMask</description>
                  <value>0x14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WNR</name>
              <description>Write or not read</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_DATA</name>
          <displayName>NVIC_DBG_DATA</displayName>
          <description>Debug Core Register Data</description>
          <addressOffset>0x00000DF8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_DBG_DATA</name>
              <description>Data temporary cache</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_INT</name>
          <displayName>NVIC_DBG_INT</displayName>
          <description>Debug Reset Interrupt Control</description>
          <addressOffset>0x00000DFC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RSTVCATCH</name>
              <description>Reset vector catch</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RSTPENDING</name>
              <description>Core reset is pending</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RSTPENDCLR</name>
              <description>Clear pending core reset</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RESET</name>
              <description>Core reset status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MMERR</name>
              <description>Debug trap on mem manage fault</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NOCPERR</name>
              <description>Debug trap on coprocessor error</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CHKERR</name>
              <description>Debug trap on usage fault check</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>STATERR</name>
              <description>Debug trap on usage fault state</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BUSERR</name>
              <description>Debug trap on bus error</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTERR</name>
              <description>Debug trap on interrupt errors</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HARDERR</name>
              <description>Debug trap on hard fault</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_TRIG</name>
          <displayName>NVIC_SW_TRIG</displayName>
          <description>Software Trigger Interrupt</description>
          <addressOffset>0x00000F00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTID</name>
              <description>Interrupt ID</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FPCC</name>
          <displayName>NVIC_FPCC</displayName>
          <description>Floating-Point Context Control</description>
          <addressOffset>0x00000F34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LSPACT</name>
              <description>Lazy State Preservation Active</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>USER</name>
              <description>User Privilege Level</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>THREAD</name>
              <description>Thread Mode</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HFRDY</name>
              <description>Hard Fault Ready</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MMRDY</name>
              <description>Memory Management Fault Ready</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BFRDY</name>
              <description>Bus Fault Ready</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MONRDY</name>
              <description>Monitor Ready</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>LSPEN</name>
              <description>Lazy State Preservation Enable</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ASPEN</name>
              <description>Automatic State Preservation Enable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FPCA</name>
          <displayName>NVIC_FPCA</displayName>
          <description>Floating-Point Context Address</description>
          <addressOffset>0x00000F38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>Address</description>
              <lsb>3</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>536870911</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FPDSC</name>
          <displayName>NVIC_FPDSC</displayName>
          <description>Floating-Point Default Status Control</description>
          <addressOffset>0x00000F3C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RMODE</name>
              <description>RMODE Bit Default</description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RN</name>
                  <description>Round to Nearest (RN) mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RP</name>
                  <description>Round towards Plus Infinity (RP) mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RM</name>
                  <description>Round towards Minus Infinity (RM) mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RZ</name>
                  <description>Round towards Zero (RZ) mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FZ</name>
              <description>FZ Bit Default</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DN</name>
              <description>DN Bit Default</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>AHP</name>
              <description>AHP Bit Default</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
